[
    {
        "text": "same treatment from the other end! Gurbaz moves across to the leg side and Theekshana follows him. Gurbaz gets low and plays a whippy sweep off his pads. Over deep backward square leg",
        "entities": [
            [
                75,
                85,
                "PERSON"
            ]
        ]
    },
    {
        "text": "is he run out at the non-striker's? Oh dear, one of the worst ways to be out. Length all on leg stump. Zazai backs away and ends up flat-batting a shot straight back. Theekshana dives to his left, can't grab the ball completely, but gets a touch that takes the ball onto his stumps. Zadran was out of his crease, he knew it as soon as that happened, didn't really wait for the TV umpire.",
        "entities": [
            [
                167,
                177,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full on middle. Zadran tries to slog across the line but it takes an inside edge, goes past leg stump, and Afghanistan win by eight wickets",
        "entities": [
            [
                16,
                22,
                "PERSON"
            ]
        ]
    },
    {
        "text": "is he one? Looks like! Gets this length ball landing outside off stump and zipping in, surprising the left-hander. He tried to shuffle forward to fend at it, but the ball whizzes past the inside edge and hits him in front of off stump. Asalanka considers reviewing but eventually doesn't, replays confirm that would hit top of middle",
        "entities": [
            [
                236,
                244,
                "PERSON"
            ]
        ]
    },
    {
        "text": "that's brave, charging Mujeeb off his first ball. Doesn't time it, though",
        "entities": [
            [
                23,
                29,
                "PERSON"
            ]
        ]
    },
    {
        "text": "clipped into the onside and he keeps the strike. Raced through that over, did Mujeeb",
        "entities": [
            [
                78,
                84,
                "PERSON"
            ]
        ]
    },
    {
        "text": "you guessed it, it's four more! Short, sat up for Rajapaksa and he pulls it away for another boundary. That's 20 in the over, or something like it, and Sri Lanka are wresting back control of this game.",
        "entities": [
            [
                50,
                59,
                "PERSON"
            ]
        ]
    },
    {
        "text": "darted in, but he's allowed him width, and Rajapaksa picks it up over cover-point and dispatches it to the boundary",
        "entities": [
            [
                43,
                52,
                "PERSON"
            ]
        ]
    },
    {
        "text": "brought out the reverse sweep and while he connected well, he sends it straight down Janat's throat at deep point. Mujeeb strikes, and a colourful Sri Lankan partnership draws to a close",
        "entities": [
            [
                115,
                121,
                "PERSON"
            ]
        ]
    },
    {
        "text": "crunches this one past point. Rajapaksa's batting on a different surface. So quick to pick up the short length and dispatch it to the boundary",
        "entities": [
            [
                30,
                39,
                "PERSON"
            ]
        ]
    },
    {
        "text": "nurdle into the onside and they get a single despite the spirited efforts of Rashid Khan to prevent it.",
        "entities": [
            [
                77,
                88,
                "PERSON"
            ]
        ]
    },
    {
        "text": "inside edge dragged onto the stumps, and Rahul departs first ball! Naseem strikes first ball, and Pakistan have their perfect start! Naseem reeled away in celebration, having taken KL Rahul's wicket off his second T20I ball. Is this going to be a nervy chase, then?",
        "entities": [
            [
                41,
                46,
                "PERSON"
            ]
        ]
    },
    {
        "text": "tailing back in at pace, and Kohli leaves. Kohli has a wry grin on his face",
        "entities": [
            [
                29,
                34,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Kohli has been dropped by Fakhar Zaman! It was at third slip, Kohli was lulled into a loose drive, got a thick edge. Tough chance, but Fakhar Zaman got two hands to it",
        "entities": [
            [
                0,
                5,
                "PERSON"
            ]
        ]
    },
    {
        "text": "good ball, tailing back into Kohli, who plays with soft hands onto his pad",
        "entities": [
            [
                29,
                34,
                "PERSON"
            ]
        ]
    },
    {
        "text": "hard length from Naseem, Kohli defends. Looks for a single, but wisely reconsiders",
        "entities": [
            [
                25,
                30,
                "PERSON"
            ]
        ]
    },
    {
        "text": "short ball, and Kohli takes it on once more. Gets a top edge, could have gone straight up, but instead it flies over the keeper's head and away for six! Early evidence suggests he'll attack the short ball",
        "entities": [
            [
                16,
                21,
                "PERSON"
            ]
        ]
    },
    {
        "text": "loose slower ball down legside, but gets away with it as Kohli's glance finds short fine leg",
        "entities": [
            [
                57,
                62,
                "PERSON"
            ]
        ]
    },
    {
        "text": "drags his length back, and Kohli defends",
        "entities": [
            [
                27,
                32,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full, yorker length. Kohli digs it out",
        "entities": [
            [
                21,
                26,
                "PERSON"
            ]
        ]
    },
    {
        "text": "strikes Rohit with the on-drive. Rohit takes evasive action, with the ball bouncing off Rohit's hand. Fortunate it didn't pop up to Shadab there",
        "entities": [
            [
                132,
                138,
                "PERSON"
            ]
        ]
    },
    {
        "text": "slapped through the offside, just the three of Shadab's first over. Absorbing one",
        "entities": [
            [
                47,
                53,
                "PERSON"
            ]
        ]
    },
    {
        "text": "flatter and short. Kohli eases it to ong-off",
        "entities": [
            [
                19,
                24,
                "PERSON"
            ]
        ]
    },
    {
        "text": "defended back to Shadab. He's in a good ryhthm, the Pakistan vice-captain",
        "entities": [
            [
                17,
                23,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Kohli sends it straight down long-off's throat. That was a bit of a gift to Iftikhar, who takes the simplest of chances. He struck it through the line, but didn't get the distance on it, and it almost felt like catching practice for the fielder. Huge moment in the game",
        "entities": [
            [
                0,
                5,
                "PERSON"
            ]
        ]
    },
    {
        "text": "dances down the ground, gets to the pitch and smashes it straight over the sightscreen. Huge six for Jadeja, taking advantage of a proper slot delivery, sending it 98m down the ground",
        "entities": [
            [
                101,
                107,
                "PERSON"
            ]
        ]
    },
    {
        "text": "darted on the pads of Jadeja who flicks a single to deep midwicket",
        "entities": [
            [
                22,
                28,
                "PERSON"
            ]
        ]
    },
    {
        "text": "pushed through on middle from round the stumps, Jadeja advances down the track and utterly batters it down the ground, straight through Nawaz's legs",
        "entities": [
            [
                136,
                141,
                "PERSON"
            ],
            [
                48,
                54,
                "PERSON"
            ]
        ]
    },
    {
        "text": "short and down the leg side, Jadeja hangs back and swats a single to long leg",
        "entities": [
            [
                29,
                35,
                "PERSON"
            ]
        ]
    },
    {
        "text": "on a length and fizzing across off stump, Jadeja slashes away from the body and is beaten",
        "entities": [
            [
                42,
                48,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Jadeja backs away outside leg, Dahani drags his length back and sends it zipping through outside off. Jadeja wafts and misses",
        "entities": [
            [
                31,
                37,
                "PERSON"
            ],
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "short and veering down the leg side, away from the reach of Jadeja's pull. Or did Jadeja glance it behind to the keeper? Not given out on the field. Pakistan ask for a review of the on-field not-out decision. Ultra Edge does not detect a spike. Nothing there. Dahani has to re-bowl this",
        "entities": [
            [
                260,
                266,
                "PERSON"
            ],
            [
                60,
                66,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Jadeja steps away outside leg, Dahani follows the moving batter with a short ball which is flapped away through midwicket. Weak pull from Jadeja as he gets cramped",
        "entities": [
            [
                31,
                37,
                "PERSON"
            ],
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "hip-high short ball just a shade outside off, 115ks, Jadeja delays the pull and sends the ball to long leg",
        "entities": [
            [
                53,
                59,
                "PERSON"
            ]
        ]
    },
    {
        "text": "short of a length and on top of off, Jadeja glides it down to deep third",
        "entities": [
            [
                37,
                43,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Dahani pounds it on a heavy length and just a shade outside off to cramp Pandya. Inside-edged into the leg side for one",
        "entities": [
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "on a length and sliding across off from over the wicket, Jadeja crouches and pushes the ball away to sweeper cover",
        "entities": [
            [
                57,
                63,
                "PERSON"
            ]
        ]
    },
    {
        "text": "bouncer down the leg side, Jadeja is beaten, as is Rizwan. The ball burst out of his gloves",
        "entities": [
            [
                27,
                33,
                "PERSON"
            ]
        ]
    },
    {
        "text": "hip-high short ball just a shade outside off, Jadeja crouches and then pulls away to deep midwicket",
        "entities": [
            [
                46,
                52,
                "PERSON"
            ]
        ]
    },
    {
        "text": "bouncer, angling across off, Jadeja lets it go. One for the over, says the umpire. Is Naseem struggling with cramps as well?",
        "entities": [
            [
                29,
                35,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Jadeja backs away outside leg and manufactures swinging room. Naseem spears it wide of off. Mid-off is up, as is cover. Jadeja reaches out for the ball and belts it away between mid-off and extra-cover",
        "entities": [
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "back of a length and swerving away outside off. Jadeja slogs to the leg side and misses",
        "entities": [
            [
                48,
                54,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Jadeja makes room once again. Naseem slams it short and wide of off, away from the reach of Jadeja. Beaten",
        "entities": [
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Naseem appeals for lbw and collapses in his followthrough. The finger goes up, Naseem goes down. Jadeja has asked for a review. 141ks, fuller and thudding into the back pad. No bat involved but the question is: did it pitch outside leg? Yes indeed.",
        "entities": [
            [
                97,
                103,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Jadeja makes room, Naseem follows him with a full ball. Jadeja lines up this slot ball and pumps a six over Naseem's head. Big strike for India",
        "entities": [
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "lifter, angling across off, beats Jadeja for pace and bouncer. Naseem ends with 2 for 27 in his four overs on debut in the oppressive Dubai heat",
        "entities": [
            [
                34,
                40,
                "PERSON"
            ]
        ]
    },
    {
        "text": "back of a length on middle, Jadeja leans back and across as he guides it to the right of point. Jadeja collides with Rauf but they're good to go again",
        "entities": [
            [
                28,
                34,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Nawaz castles Jadeja. Flat and quick from around the stumps, Jadeja goes for the massive slog and does not connect. Nawaz hits the stumps. Pandya sinks to his knees at the other end",
        "entities": [
            [
                0,
                5,
                "PERSON"
            ],
            [
                14,
                20,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Hit on the pads, and the umpire gives it! Rizwan reviews immediately, height the only question It's missing! Rizwan survives.. It hit him on the back leg as he looked to swipe into the onside and ended up misjudging the bounce",
        "entities": [
            [
                42,
                48,
                "PERSON"
            ]
        ]
    },
    {
        "text": "played on the up, and it sppeared to beat outside edge by a whisker. Bhuveneshwar is convinced Rizwan got a nick, and India review It's not out, there's no spike. India lose a review, and Rizwan survives again",
        "entities": [
            [
                95,
                101,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball, a little nudge from Rizwan into the covers and the pair exchange ends",
        "entities": [
            [
                33,
                39,
                "PERSON"
            ]
        ]
    },
    {
        "text": "pushes this to mid-off and scampers through for a risky single. He has to put in the dive, but then again, Rizwan doesn't need an excuse to dive",
        "entities": [
            [
                107,
                113,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Rizwan's not quite found his bearings. Lost his balance driving to drive that. India seem to understand how to bowl to him",
        "entities": [
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "defended back to the bowler. It's a bit of a grind from Rizwan so far",
        "entities": [
            [
                56,
                62,
                "PERSON"
            ]
        ]
    },
    {
        "text": "bouncer from Pandya. Rizwan tried to hook it but ends up missing",
        "entities": [
            [
                21,
                27,
                "PERSON"
            ]
        ]
    },
    {
        "text": "he needed to hit out or get out, and hit out he does! Steps across and whips it over cow corner; that is trademark Rizwan. It goes into the stands for a colossal, 87m six",
        "entities": [
            [
                115,
                121,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full delivery, and he's whipped it tow midwicket for a boundary. What a stunning shot that was. Is Rizwan finally playing himself into form?",
        "entities": [
            [
                99,
                105,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a bit too straight. Iftikhar turns it round the corner and gets another single",
        "entities": [
            [
                20,
                28,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball, blocked from Iftikhar",
        "entities": [
            [
                26,
                34,
                "PERSON"
            ]
        ]
    },
    {
        "text": "timed gloriously though the covers. Backfoot punch from Iftikhar, really. Not much more than that, and it beats a diving Chalal in the deep",
        "entities": [
            [
                56,
                64,
                "PERSON"
            ]
        ]
    },
    {
        "text": "skidded on, pushing Rizwan back to defend",
        "entities": [
            [
                20,
                26,
                "PERSON"
            ]
        ]
    },
    {
        "text": "swept to short fine leg. An errant throw meant there was a small chance of an overthrow, but Rizwan opts against it",
        "entities": [
            [
                93,
                99,
                "PERSON"
            ]
        ]
    },
    {
        "text": "that looked like it was in the slot, and Rizwan tried to smash it over midwicket. Doesn't time it though, and it's smeared along the ground",
        "entities": [
            [
                41,
                47,
                "PERSON"
            ]
        ]
    },
    {
        "text": "darted in flat, and Iftikhar defends",
        "entities": [
            [
                20,
                28,
                "PERSON"
            ]
        ]
    },
    {
        "text": "mistimes a slog through the onside once more. Inside edge through to fine leg for a single. He's tempting Rizwan, who can't execute at the moment",
        "entities": [
            [
                106,
                112,
                "PERSON"
            ]
        ]
    },
    {
        "text": "pushed through outside off, slightly short, that length is enough for Rizwan to go back and late-cut it away between backward point and short third for four",
        "entities": [
            [
                70,
                76,
                "PERSON"
            ]
        ]
    },
    {
        "text": "sliding into off, much fuller, inside-edged onto the pad and the ball rolls back to Jadeja. Rizwan takes on Jadeja's arm for a single. A direct hit could've been tight",
        "entities": [
            [
                84,
                90,
                "PERSON"
            ],
            [
                92,
                98,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Chahal drops a return catch. Fast full-toss on off or just a shade outside off, stabbed back to him. Chahal snatches at the ball, but it pops out of his hands",
        "entities": [
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Rizwan jumps across off and pulls a double to deep midwicket",
        "entities": [
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Rizwan shuffles across off, meets a wide full-toss and drives it in the gap between extra-cover and mid-off for four",
        "entities": [
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Another short ball. Another wicket for India. Hardik bounces out another batter. Banged in short and keeps ducking in with the angle from over the wicket. Rizwan looks away and is surprised by the bounce. He goes low, aims to ramp half-heartedly and ends up guiding this 141kph delivery into the hands of Avesh at deep third",
        "entities": [
            [
                46,
                52,
                "PERSON"
            ],
            [
                155,
                161,
                "PERSON"
            ]
        ]
    },
    {
        "text": "fullish and on middle, 140ks, Shadab wanders across off stump and works a single to mid-on. He takes on Surya's arm for a single. Surya misses a direct hit",
        "entities": [
            [
                30,
                36,
                "PERSON"
            ]
        ]
    },
    {
        "text": "another short ball but directed down the leg side. Re-set the radar, Hardik",
        "entities": [
            [
                69,
                75,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full on the stumps, hammered past the outstretched right hand of Chahal. Pakistan settle with a single",
        "entities": [
            [
                65,
                71,
                "PERSON"
            ]
        ]
    },
    {
        "text": "low full-toss on off, Chahal dives to his left from his followthrough to stop this push",
        "entities": [
            [
                22,
                28,
                "PERSON"
            ]
        ]
    },
    {
        "text": "slower ball from Bhuvneshwar, hides it away from the swinging arc of Shadab who wafts and misses outside off",
        "entities": [
            [
                17,
                28,
                "PERSON"
            ],
            [
                69,
                75,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Holes out to Surya at long-off. Slower legcutter from Bhuvneshwar. Asif lofts in the air, does not get enough elevation. Picks out Surya at the boundary. Pakistan sink further in Dubai",
        "entities": [
            [
                54,
                65,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Arshdeep comes back and has Nawaz nicking off to DK. On a length and wobbles away outside off from over the wicket. Nawaz has a feeble little prod at it and edges it to the keeper",
        "entities": [
            [
                28,
                33,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Bhuvneshwar misses the yorker. Full-toss on the pads, Shadab sizes it up and swipes it over square leg for six",
        "entities": [
            [
                0,
                11,
                "PERSON"
            ],
            [
                54,
                60,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Bhuvneshwar spins around for an lbw appeal and the finger goes up. Shadab challenges the on-field out decision. Very full and ducks back in to catch the batter on the crease. Did Shadab nick this? Ultra Edge does not detect a spike when ball passes bat. The tracker returns three reds and Shadab has to go",
        "entities": [
            [
                0,
                11,
                "PERSON"
            ],
            [
                67,
                73,
                "PERSON"
            ]
        ]
    },
    {
        "text": "another lbw appeal, and the finger goes up once again. Pakistan goes for a review once again. Full again from Bhuvneshwar, skids back in to ping the pad on the knee-roll. Not bat involved. Ball-tracking suggests it would have shaved the top of the stumps. Umpire's call and Naseem bags a golden duck on debut",
        "entities": [
            [
                110,
                121,
                "PERSON"
            ]
        ]
    },
    {
        "text": "good length and slanting into off, Dahani gets right behind the line and blocks to mid-off",
        "entities": [
            [
                35,
                41,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Dahani swings for the hills. Launched over long-on for six. Pitched-up delivery outside off, slot ball from Bhuvneshwar and he cops punishment",
        "entities": [
            [
                108,
                119,
                "PERSON"
            ],
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Dahani clobbers another six, this is swatted over midwicket. Arshdeep bangs it into the middle of the pitch. Possibly a slower ball. Dahani has a roundhouse swipe at it. He is pumped",
        "entities": [
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Arshdeep yorks Dahani and closes out the innings. Wide on the crease, inswinging yorker. Squeezes underneath the bat and clatters into the base of middle stump",
        "entities": [
            [
                15,
                21,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Gurbaz is gone stumped! The pressure was beginning to tell, and Gurbaz is the first to lose his head. He comes down the ground but Shakib sees it early, and fires it shorter and flatter. Mushfiqur collects this quite low and breaks the stumps.",
        "entities": [
            [
                131,
                137,
                "PERSON"
            ]
        ]
    },
    {
        "text": "good length on off, driven but straight to a wide mid-off. Great over from Shakib.",
        "entities": [
            [
                75,
                81,
                "PERSON"
            ]
        ]
    },
    {
        "text": "pushed through on a length, driven to the right of Mosaddek who moves across to collect",
        "entities": [
            [
                51,
                59,
                "PERSON"
            ]
        ]
    },
    {
        "text": "And this time he's got him! Zazai goes for the sweep, and misses it completely. He's struck flush on the back thigh pad in front of middle and leg to one that was pushed through by Mosaddek. Zazai reviews. Afghanistan retain a review as it's umpire's call, but Zazai has to go as this is shown to be clipping leg stump.",
        "entities": [
            [
                181,
                189,
                "PERSON"
            ]
        ]
    },
    {
        "text": "back of a length on off, defended back towards Taskin",
        "entities": [
            [
                47,
                53,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball pushed through, driven back to Shakib",
        "entities": [
            [
                43,
                49,
                "PERSON"
            ]
        ]
    },
    {
        "text": "good length on off, pushed through quick again. And Zadran throws back his head in disappointment as he's unable to get this away yet again.",
        "entities": [
            [
                52,
                58,
                "PERSON"
            ]
        ]
    },
    {
        "text": "slower one, 110kph. Full around off. Anamul was late to pick it and had to defend in the end",
        "entities": [
            [
                37,
                43,
                "PERSON"
            ]
        ]
    },
    {
        "text": "another slower one, 104kph. This time in the line of the stumps. Anamul punches it towards mid-off",
        "entities": [
            [
                65,
                71,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball but down the leg side. Anamul goes for a sweep but fails to connect. Called a wide",
        "entities": [
            [
                35,
                41,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball, spinning in. Shakib backs away and looks to flick but misses and is hit on the pads. An appeal for lbw but it was going down. Gets a leg-bye to short third",
        "entities": [
            [
                26,
                32,
                "PERSON"
            ]
        ]
    },
    {
        "text": "an appeal for lbw. Not given but Afghanistan have gone for the review. Looks out to me. Was short of length on the stumps and spinning in. Anamul bends his back leg as he looks to pull-sweep it. Misses. The ball-tracking shows it hit him in front of middle and leg and would have gone on to hit the leg stump. Bangladesh lose their second wicket",
        "entities": [
            [
                139,
                145,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Mujeeb gets his third. Another left-hander bowled through the gate with the carrom ball. Shakib backs away to give him some room and looks to smash it down the ground. Misses it altogether and the ball clatters into middle and leg stump",
        "entities": [
            [
                0,
                6,
                "PERSON"
            ],
            [
                89,
                95,
                "PERSON"
            ]
        ]
    },
    {
        "text": "another googly. Comes on the front foot to defend but is beaten on the inside edge and is rapped on the front pad. A loud appeal for lbw but not given. Afghanistan have sent this upstairs. No bat involved, but was it spinning down the leg side? The ball tracking says no. The impact was in front of the middle stump and it would have clattered into the leg stump. Mushfiqur walks back. Bangladesh reeling at 28 for 4",
        "entities": [
            [
                364,
                373,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full outside off, another googly. Mahmudullah looks to drive through covers, gets an inside edge towards short fine leg",
        "entities": [
            [
                34,
                45,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball but this time it's down the leg side. Mahmudullah flicks it fine this time, to the right of short fine and picks up a boundary",
        "entities": [
            [
                50,
                61,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length outside off, a googly. Mahmudullah chops it towards short third",
        "entities": [
            [
                30,
                41,
                "PERSON"
            ]
        ]
    },
    {
        "text": "down the track and goes straight down the ground. Got more height than distance. Omarzai runs to his right from long-off and takes it just inside the boundary line and tosses it to Rashid, who came in from long-on. The question is if Omarzai's shoe touched the boundary cushion. The soft signal is out but I think the shoe just brushed the boundary line. The third umpire says as much, so it's a six for Mosaddek and Bangladesh",
        "entities": [
            [
                404,
                412,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a googly outside off, 93kph. Mahmudullah looks to drive through covers but gets an inside edge towards backward square leg",
        "entities": [
            [
                29,
                40,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a carrom ball around off, flicked towards short midwicket. Mujeeb himself fields it",
        "entities": [
            [
                59,
                65,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball on the stumps, tucked away towards midwicket. The fielder charges in and throws it to the bowler's end. On the volley to Mujeeb who too a couple of steps but could make only a partial stop",
        "entities": [
            [
                133,
                139,
                "PERSON"
            ]
        ]
    },
    {
        "text": "almost a yorker on the leg stump. Mahmudullah backs away and digs it out towards wide long-on",
        "entities": [
            [
                34,
                45,
                "PERSON"
            ]
        ]
    },
    {
        "text": "an appeal for stumping. A legbreak around off, spinning away to just miss the off stump. Mosaddek was looking to go inside out over extra cover but misses. Gurbaz collects the ball and breaks the stumps. The foot was grounded but was there some part behind the crease? Yes, a smidgen. Mosaddek survives again",
        "entities": [
            [
                89,
                97,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full around off, it's another legbreak from Rashid. Mahmudullah goes for the slog sweep but gets more of a top edge. Ibrahim Zadran runs in from deep midwicket, dives forward and completes the catch",
        "entities": [
            [
                52,
                63,
                "PERSON"
            ]
        ]
    },
    {
        "text": "googly but down the leg side. Mosaddek manages a faint edge on the flick. The short fine leg should have stopped it. He dives to his right but mesess up",
        "entities": [
            [
                30,
                38,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a slower one bowled into the surface. Mosaddek was looking to pull it first but had ample time to change his mind. Dabs it towards short third in the end",
        "entities": [
            [
                38,
                46,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full outside off, Mosaddek was backing away and can only watch the ball go through to the keeper. He looks at the umpire hoping for a wide but it's not",
        "entities": [
            [
                18,
                26,
                "PERSON"
            ]
        ]
    },
    {
        "text": "economy of six in Kohli's first over. Tidy sixth-bowler job so far. Full on off, and flicked to deep midwicket where the man runs in to ensure it stays just one",
        "entities": [
            [
                18,
                23,
                "PERSON"
            ]
        ]
    },
    {
        "text": "McKechnie backs away with Bhuvi running in, but gets into position before the ball is delivered. Tries the reverse lap to this full ball outside off, but misses.",
        "entities": [
            [
                0,
                9,
                "PERSON"
            ]
        ]
    },
    {
        "text": "that's gone all the way! Short ball outside off, McKechnie jumps up, his legs not in touch with the ground as he slaps a six over deep third!",
        "entities": [
            [
                49,
                58,
                "PERSON"
            ]
        ]
    },
    {
        "text": "short third fails to dive and stop this late cut off this length ball, and Avesh will end up conceding 53 runs. McKechnie waited for the ball to get to him before playing the shot past Chahal.",
        "entities": [
            [
                112,
                121,
                "PERSON"
            ]
        ]
    },
    {
        "text": "short of length on the stumps, a bit of extra bounce. Rahul stays back and turns it towards short fine leg",
        "entities": [
            [
                54,
                59,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball around off, Rahul stays still and smashes it in front of deep square leg, all the way for a six",
        "entities": [
            [
                24,
                29,
                "PERSON"
            ]
        ]
    },
    {
        "text": "goes for the yorker but it's down the leg side. Rahul takes it on the full and flicks it behind square leg",
        "entities": [
            [
                48,
                53,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Hong Kong get the first wicket. This time Rohit moves towards the off side but Shukla slips in an offcutter. Rohit goes for the pull but the ball hits him high on the bat, almost towards the edge and Aizaz takes a good catch, coming in from mid-on and diving forward",
        "entities": [
            [
                79,
                85,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full around off, fired in at 104kph. Kohli uses his wrists to push it towards long-on",
        "entities": [
            [
                37,
                42,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length, pitching on leg and going further down. Rahul leaves that alone",
        "entities": [
            [
                48,
                53,
                "PERSON"
            ]
        ]
    },
    {
        "text": "short of length on the stumps, Rahul goes for the pull but gets a top edge towards deep third. Luckily for him, it lands safely",
        "entities": [
            [
                31,
                36,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball on the stumps, Kohli places it towards midwicket, sprints for the first and is looking for the second but Rahul says no. The bowler himself does the fielding",
        "entities": [
            [
                27,
                32,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Rahul skips down the track but Murtaza bowls it slow and wide. Rahul had to reach out and cuts it to the right of the diving cover fielder. The sweeper makes a diving stop to his left",
        "entities": [
            [
                0,
                5,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full around middle, and Rahul just launches it over deep midwicket, for an 83 metre six",
        "entities": [
            [
                24,
                29,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball around middle. Was looking to turn it on the leg side but gets an outside edge towards mid-off. Rahul wanted a single but Kohli says no",
        "entities": [
            [
                108,
                113,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball outside off, Kohli comes down the track and cuts it towards extra cover",
        "entities": [
            [
                25,
                30,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length outside off, 79kph. Kohli pushes it towards cover for one",
        "entities": [
            [
                27,
                32,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Kohli gets back on strike with some quick running. Full just outside off, and he came down the ground to drill it straight back. Ball was in the air and Ghazanfar put his right hand out to catch it, but it hit his fingers before going to long off",
        "entities": [
            [
                0,
                5,
                "PERSON"
            ]
        ]
    },
    {
        "text": "was there a message passed along at the drinks break? Tossed up around off. Kohli skips down the track and hammers it over the bowler's head!",
        "entities": [
            [
                76,
                81,
                "PERSON"
            ]
        ]
    },
    {
        "text": "the left-arm spinner coming around the wicket pitches it full, and slightly outside off. Kohli comes down the track and mistimes a lofted shot towards deep midwicket",
        "entities": [
            [
                89,
                94,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a couple more for India. Rahul moves across to the off side and the bowler delivers a fullish ball on middle and leg. Tries to play a sweep fine, but hits his glove, past the keeper's grasp. And two more to the total",
        "entities": [
            [
                25,
                30,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full outside off. Rahul comes down the track and mistimes a shot to long on's right",
        "entities": [
            [
                18,
                23,
                "PERSON"
            ]
        ]
    },
    {
        "text": "less than six runs in this over. Rahul tries the reverse paddle, but he may have gotten saved despite missing the shot, since impact on his pad/body was outside leg stump. Soft LBW appeal turned down. Rahul had changed his stance as soon as Murtaza delivered the ball, but perhaps was done in by the lack of pace from the left-arm bowler.",
        "entities": [
            [
                33,
                38,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Kohli operating at a strike-rate of 100 too. Full on off. Comes down the track and drills a shot to long on along the carpet",
        "entities": [
            [
                0,
                5,
                "PERSON"
            ]
        ]
    },
    {
        "text": "maximum! And that's got the crowd on its feet. Full just outside off. Kohli gets down on one knee, and absolutely creams a slog sweep over cow corner. Fifty stand in 7.5 overs",
        "entities": [
            [
                70,
                75,
                "PERSON"
            ]
        ]
    },
    {
        "text": "out for a 39-ball 36! Full, just outside off. Rahul tries to drag a sweep from outside off, but it's taken an edge. Hits the keeper on the chest, but he keeps his eyes on the ball and collects on the rebound. Extra bounce off the surface, it seems.",
        "entities": [
            [
                46,
                51,
                "PERSON"
            ]
        ]
    },
    {
        "text": "fullish, on off. Yadav stays on the back foot and gently taps it to the bowler's right. Murtaza finishes his four overs for 27",
        "entities": [
            [
                17,
                22,
                "PERSON"
            ]
        ]
    },
    {
        "text": "his third boundary in six balls And once again behind square on the leg side. Full toss around leg, and Yadav swept it quite hard to fine leg. Fielder was there for the shot, but..... the ball bursts through his hands! Ehsan a bit lazy in his attempt, not getting low enough, nor getting his legs behind the ball by bending down",
        "entities": [
            [
                104,
                109,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full ball just outside off. Yadav tries his well-tested sweep, but misses on this occasion. Smart grab by the gloveman",
        "entities": [
            [
                28,
                33,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full on middle. Kohli skips down the ground and gets to the pitch of the ball before lofting a six over deep midwicket. Sets the tone for the over, right from the first ball. Seems like Aizaz bowled a pace-off delivery, but no problem for VK",
        "entities": [
            [
                16,
                21,
                "PERSON"
            ]
        ]
    },
    {
        "text": "strike rate of 237.50 with his fourth boundary in eight deliveries. Length ball, a bit wide outside off. Yadav backs away slightly and slashes hard, getting a thick edge on purpose over short third for four",
        "entities": [
            [
                105,
                110,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full ball on leg, but going down for a wide. Kohli did attempt a flick though",
        "entities": [
            [
                45,
                50,
                "PERSON"
            ]
        ]
    },
    {
        "text": "the offie is back. Full just outside off, darting it in. Kohli tried a reverse paddle, but misses. Keeper gets low and collects.",
        "entities": [
            [
                57,
                62,
                "PERSON"
            ]
        ]
    },
    {
        "text": "class personified! Ehsan goes full and flat on middle. But Kohli clears the front leg, gets down on one knee, and picks it up beautifully to deposit a six over deep midwicket. A 91-metre six.",
        "entities": [
            [
                59,
                64,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full toss on leg stump with Kohli backing away exposing all three stumps. Mistimed drive to deep extra cover's right for two more",
        "entities": [
            [
                28,
                33,
                "PERSON"
            ]
        ]
    },
    {
        "text": "finishes on 0 for 26 despite an expensive final over. Full ball on middle. Kohli tries to go over deep midwicket again but the shot hits his body",
        "entities": [
            [
                75,
                80,
                "PERSON"
            ]
        ]
    },
    {
        "text": "eighteen off the first three balls! Slower ball on off. Yadav keeps a still head and offers the full face of the bat as he lofts it over the bowler's head.",
        "entities": [
            [
                56,
                61,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Edged and goes for a four. Oh, some luck now for Shanaka. Throws the slower length ball wide. Shanaka looks to force it through covers, edges and the ball races past the keeper.",
        "entities": [
            [
                49,
                56,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Angled into Shanaka who is rapped on the pads with the ball sliding down.",
        "entities": [
            [
                12,
                19,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Down the ground and Mosaddek takes the catch! Is this the game? Was in the slot on middle, Shanaka gets a good piece of it but not enough and long on takes a simple catch. he was looking to hit it hard but failed to clear the ropes.",
        "entities": [
            [
                91,
                98,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Strays on the pads, and it's glanced fine for four! Great start for Bangladesh, bit wayward one from Sri Lanka and Madushanka.",
        "entities": [
            [
                115,
                125,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Paddle sweep down to fine leg! Bit of invention here, as Sabbir premeditates and just about gets the connection he wants. Fine leg is in and this flies high over his head. The timing is not quite right, but the ball has enough legs to reach the ropes.",
        "entities": [
            [
                57,
                63,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Sabbir looks to work this onside from a length and almost gets a leading edge back to the bowler.",
        "entities": [
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "good length on the stumps, stays back and pushes this back to Theekshana.",
        "entities": [
            [
                62,
                72,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Edged and taken! The peppering of short stuff gets the desired result! Sabbir goes for another pull, and he's once more late on the stroke. But this time he can only get a thick edge through to the keeper.",
        "entities": [
            [
                71,
                77,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Slower ball, 122kph, back of a length. Shakib is looking to smash this but is forced to hold back and dab it to mid-off for one",
        "entities": [
            [
                39,
                45,
                "PERSON"
            ]
        ]
    },
    {
        "text": "short and wide, cut hard to cover. Missed opportunity for Shakib.",
        "entities": [
            [
                58,
                64,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length outside off, googly. Mushfiqur goes back and cuts this to backward point for one.",
        "entities": [
            [
                28,
                37,
                "PERSON"
            ]
        ]
    },
    {
        "text": "leg cutter to start, which Mushfiqur guides down to third man with soft hands",
        "entities": [
            [
                27,
                36,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full on off, Shakib looks to lean back and hit this back down the ground but can't connect as he would like. Goes straight to Chamika on the bounce.",
        "entities": [
            [
                13,
                19,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Short and top edged on the pull. Shakib is very lucky here as it falls agonisingly wide of short fine leg running around.",
        "entities": [
            [
                33,
                39,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full and strikes him on the pads. This is going down leg, but Mushfiqur knows he should be putting those away",
        "entities": [
            [
                62,
                71,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Edged and gone! Back of a length and jagging away having pitched on middle, it has Mushfiqur defending on the back foot as the ball takes a healthy nick through to Mendis behind the stumps.",
        "entities": [
            [
                83,
                92,
                "PERSON"
            ]
        ]
    },
    {
        "text": "fuller and driven back to Theekshana",
        "entities": [
            [
                26,
                36,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Another fortunate escape for Shakib! He goes for a sweep, and ends up top edging this high and straight. Long-off runs in to take the catch but can't get there in time.",
        "entities": [
            [
                29,
                35,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Scooped for four! Shuffles across and just uses the pace to run this down to fine leg. 6000 runs for Shakib as well!",
        "entities": [
            [
                101,
                107,
                "PERSON"
            ]
        ]
    },
    {
        "text": "And it's a carbon copy of the previous stroke! Great batting from Shakib,",
        "entities": [
            [
                66,
                72,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Cleans him with a ripper! Flights this one ever so slightly, Shakib as he has done all innings, gives himself room looking to loft over covers. Theekshana though keeps it wicket to wicket as the ball turns just that bit and beats Shakib all ends up. The middle stump takes a beating. Was the conventional off-break from Theekshana and had Shakib deceived. The batter is livid with himself as he walks off.",
        "entities": [
            [
                144,
                154,
                "PERSON"
            ],
            [
                61,
                67,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Off break angled into the batter, who watches closely and pushes to point. Excellent spell from Theekshana.",
        "entities": [
            [
                96,
                106,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Short of a length rising around the hip area as Mahmudullah mistimes his pull close to the bowler",
        "entities": [
            [
                48,
                59,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Length on the pads, he flicks it nicely to the right of backward square leg for a brace. Got that in the gap nicely, did Mahmudullah",
        "entities": [
            [
                121,
                132,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Sower short ball on middle, he works it to short fine leg who collects it on the bounce. They were looking for a run, but Afif was sent back and rightly so. Mahmudullah would not have made it.",
        "entities": [
            [
                122,
                126,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Banged in short into the body of Mahmudullah who gets across and helps it to deep square leg for a run.",
        "entities": [
            [
                33,
                44,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Oh, nicely done! Fuller, pacy delivery on middle, he gets across and this time nails the scoop over short fine leg. Afif is playing a gem.",
        "entities": [
            [
                116,
                120,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Length outside off, he laces the drive to mid-off and sets off for a quick run. The fielder has a shy at the stumps, misses but Afif would have made it.",
        "entities": [
            [
                128,
                132,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Full toss on the pads, Mahmudullah does not capitalise fully and can just work it to the right of backward square leg for a brace",
        "entities": [
            [
                23,
                34,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Ah, that was a poor delivery down leg. Length on the pads, easy pickings for Afif who just flicks it over short fine leg.",
        "entities": [
            [
                77,
                81,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Picks out the fielder to precision! Slower length ball on middle stump, Afif was looking to go much straighter but loses shape and ends up dragging it to cow corner where Hasaranga pouches a simple catch.",
        "entities": [
            [
                72,
                76,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Hasaranga returns and gets the big fish! Flighted gently on off, was the leg-spinner. Mahmudullah was looking for the slog sweep, but looks like was deceived by the slowness and was into his shot a bit early. Ends up getting a top edge with Chamika Karunaratne at deep midwicket taking a simple catch.",
        "entities": [
            [
                86,
                97,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Back of a length outside off, that was again a slower ball. Taskin lofts it over extra cover, three fielder gives chase and a boot is needed to rein it in. They take three.",
        "entities": [
            [
                60,
                66,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Slower bouncer again, Taskin is again into the shot early. Gets a thick inside edge to the right of short fine leg.",
        "entities": [
            [
                22,
                28,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Length outside leg, but he gives himself room and absolutely thumps it straight down the ground. What a hit that was! Did not move, did Mosaddek",
        "entities": [
            [
                136,
                144,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Dahani slides down the leg side. Nizakat is beaten on the flick but gets two leg-byes to fine leg",
        "entities": [
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "late on the pull and he is caught. Dahani gets it head high, and Murtaza manages just a soft top edge. Khushdil charges in from mid-on and dives to take the low catch",
        "entities": [
            [
                35,
                41,
                "PERSON"
            ]
        ]
    },
    {
        "text": "another wrong'un, but this is a wide down leg. Mind you, don't think McKechnie picked it",
        "entities": [
            [
                69,
                78,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full enough for the lbw? The umpire thinks so, but the batter has reviewed it. Nawaz is bowling from round the wicket and bowls it full. Shah is beaten on the slog sweep and hit on the pad. But I don't see any turn back in. The only way he gets the lbw then is with a really full ball that doesn't have time to angle past the off stump. This is full enough. Just about. Clipping off, says the ball tracker. That makes it five down",
        "entities": [
            [
                79,
                84,
                "PERSON"
            ]
        ]
    },
    {
        "text": "taps a full toss back to Shadab. Just over him. Shadab loses his balance. That means he can't jump high enough",
        "entities": [
            [
                25,
                31,
                "PERSON"
            ]
        ]
    },
    {
        "text": "they are not reading Shadab. Haroon looks to go down for a sweep, sees the length is not quite there, then tries to just guide it behind square on the leg side, and gets too far inside the line. The wrong'un does the rest",
        "entities": [
            [
                21,
                27,
                "PERSON"
            ]
        ]
    },
    {
        "text": "gone, bowled him! Another clueless slog from a Hong Kong batter, and Shadab is on a hat-trick. This was tossed up, and was a wrong 'un. It spent a good few second wobbling in, and pitched full outside off, before turning in to strike off stump as Shukla missed his slog",
        "entities": [
            [
                69,
                75,
                "PERSON"
            ],
            [
                247,
                253,
                "PERSON"
            ]
        ]
    },
    {
        "text": "another inside edge. This time Shukla bowls the full outswinger, Rizwan looks to drive down the ground but gets a thick inside edge towards square leg",
        "entities": [
            [
                31,
                37,
                "PERSON"
            ],
            [
                65,
                71,
                "PERSON"
            ]
        ]
    },
    {
        "text": "finally a shot is timed well, but it is driven straight to extra cover. Not a half-volley but Rizwan gets it out of the screws",
        "entities": [
            [
                94,
                100,
                "PERSON"
            ]
        ]
    },
    {
        "text": "slower off the pitch, Rizwan runs this down to deep third for one",
        "entities": [
            [
                22,
                28,
                "PERSON"
            ]
        ]
    },
    {
        "text": "short ball, but on pace, and Zaman pulls this to the right of short fine leg for four",
        "entities": [
            [
                29,
                34,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Rizwan shuffles across to try to pull the ball square and this stays low to beat the pull",
        "entities": [
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "short of a length, wide, Rizwan beaten on the attempt to run it down behind square",
        "entities": [
            [
                25,
                31,
                "PERSON"
            ]
        ]
    },
    {
        "text": "quick outside off, Rizwan opens the face and is beaten again",
        "entities": [
            [
                19,
                25,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Rizwan sees a spinner give it air for the first time and he goes down on a knee ton sweep it behind long leg for four",
        "entities": [
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "slow again, just outside off, Rizwan pushes it into the covers for one",
        "entities": [
            [
                30,
                36,
                "PERSON"
            ]
        ]
    },
    {
        "text": "dropped?. Or has he? they are going upstairs to see if he has taken it cleanly. This is again tesingly slow, Rizwan defends, gets an inside edge onto the pad, and the ball reaches McKechnie on the half-volley",
        "entities": [
            [
                109,
                115,
                "PERSON"
            ]
        ]
    },
    {
        "text": "down on a knee, Ghazanfar bowls wide outside off, Rizwan opens the face to guide it fine of short third for two",
        "entities": [
            [
                50,
                56,
                "PERSON"
            ]
        ]
    },
    {
        "text": "he is a lovely bowler. Bowl slow and gets dip. Rizwan tries to sweep but the ball is not where he expects it to be. Toe-ends it for one",
        "entities": [
            [
                47,
                53,
                "PERSON"
            ]
        ]
    },
    {
        "text": "good length ball, and around sixth stump. Rizwan tries to pull but misses, as the ball keeps low. There is an appeal for stumping, as it goes up to the third umpire. There is no bat involved as ball passes it. His back foot did move for a second, but eventually seems stable on the crease as the bails are whipped off. So not out",
        "entities": [
            [
                42,
                48,
                "PERSON"
            ]
        ]
    },
    {
        "text": "wide down the leg side. A fullish delivery angling into and ending outside leg, as Rizwan flicks but misses. He almost his balance for once, before they pinched an extra run",
        "entities": [
            [
                83,
                89,
                "PERSON"
            ]
        ]
    },
    {
        "text": "the googly, but Rizwan slaps that for four! Short outside off, and turning in to end close to off. Rizwan gets deep in the crease, before sending that crashing to deep point's left",
        "entities": [
            [
                16,
                22,
                "PERSON"
            ]
        ]
    },
    {
        "text": "very slow, tossed up and on a shortish length outside off. Turns away, as he waits before cutting to deep point. And that is another fifty for Rizwan",
        "entities": [
            [
                143,
                149,
                "PERSON"
            ]
        ]
    },
    {
        "text": "starts with a wide. Slower ball on a good length, and angling down leg. Khushdil wanted to flick, but missed",
        "entities": [
            [
                72,
                80,
                "PERSON"
            ]
        ]
    },
    {
        "text": "launched over long-off! This one was full and in the slot outside off, as Khushdil hung deep in the crease and spotted mid-off inside the circle. Eight runs off one ball this over",
        "entities": [
            [
                74,
                82,
                "PERSON"
            ]
        ]
    },
    {
        "text": "good stop by the keeper tumbling to his right. Another slower ball, as he went back to the good length deliveries angling in. Khushdil tried to pull, but the ball took his pad",
        "entities": [
            [
                126,
                134,
                "PERSON"
            ]
        ]
    },
    {
        "text": "another wide. This isn't really working for Shukla, as he goes shorter with change of pace, with the ball bouncing high and ending outside leg",
        "entities": [
            [
                44,
                50,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Shukla finally gets it near to what he wanted. Short and angling into leg, and pulled to fine leg off the higher side of the bat",
        "entities": [
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a yorker length ball tailing in to end on middle and leg. A gentle nudge towards long-on, and while the bowler gave the chase, Rizwan called for two and got it after a bit of confusion",
        "entities": [
            [
                127,
                133,
                "PERSON"
            ]
        ]
    },
    {
        "text": "woah, that is a clever change of length. Bangs it in short on middle and off, as Khushdil tried to swat but missed again, with the pace of the ball getting to him",
        "entities": [
            [
                81,
                89,
                "PERSON"
            ]
        ]
    },
    {
        "text": "fired over deep midwicket! Khushdil's third six. Gets a shortish ball just outside off, and hammers that pull far and wide to keep the momentum going",
        "entities": [
            [
                27,
                35,
                "PERSON"
            ]
        ]
    },
    {
        "text": "slower ball, full on middle. Bit of swing into him. Nissanka picks the pace early, and drives well, but only to mid on",
        "entities": [
            [
                52,
                60,
                "PERSON"
            ]
        ]
    },
    {
        "text": "fullish outside off and turning in. Mendis plays a late cut to short third and takes off for one. Is Nissanka in trouble? Throw is flat and on top of the stumps, but the side-on umpire is confident that the batter was in.",
        "entities": [
            [
                36,
                42,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full on off stump. Pace off. Nissanka taps it back towards Mendis, and the bowler tracks to his left to intercept",
        "entities": [
            [
                29,
                37,
                "PERSON"
            ]
        ]
    },
    {
        "text": "back of a length on middle. Nissanka not in control while trying to pull. Top edge over the keeper and that that has four written all over it once it landed beyond Gurbaz",
        "entities": [
            [
                28,
                36,
                "PERSON"
            ]
        ]
    },
    {
        "text": "fullish outside off. Bit of turn into Mendis. Slaps a cut to point, but no single on offer",
        "entities": [
            [
                38,
                44,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Sri Lanka getting a move on! And this time it is Mendis joining the party. A touch short from Mujeeb, and Mendis gets down on one knee before slog sweeping over deep square leg!",
        "entities": [
            [
                94,
                100,
                "PERSON"
            ],
            [
                49,
                55,
                "PERSON"
            ]
        ]
    },
    {
        "text": "good length ball on middle. Nissanka backs away and nurdles a clip off his pads to deep square leg",
        "entities": [
            [
                28,
                36,
                "PERSON"
            ]
        ]
    },
    {
        "text": "no you didn't, Mendis! Taking on the opponent's best bowler early. What a way to get to fifty. He has seen enough. Gets low early, centre of gravity quite low thus, and thereafter plays a slog sweep uppishly on purpose. Beyond deep midwicket",
        "entities": [
            [
                15,
                21,
                "PERSON"
            ]
        ]
    },
    {
        "text": "even better from BKG! Fullish on middle, and Mendis uses the googly to his advantage by clearing the front leg, swiveling slightly while getting down on one knee, and finishing it off by hammering a slog sweep over deep square leg.",
        "entities": [
            [
                45,
                51,
                "PERSON"
            ]
        ]
    },
    {
        "text": "that may have gone onto the road! Full ball, a bit flatter, just outside off. Nissanka gets low and creams a slog sweep in front of square. Flies across the night sky.",
        "entities": [
            [
                78,
                86,
                "PERSON"
            ]
        ]
    },
    {
        "text": "wicket off the wide ball! Nissanka gets back to cut off this wide ball outside off, but perhaps the extra bounce does the trick. Big edge, but swiftly into Gurbaz's gloves, so credit to him for grabbing onto it. No turn this time, looks like the carrom ball.",
        "entities": [
            [
                26,
                34,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball, skids through and Asalanka just about gets bat to this as he looks to cut this in front of the stumps. Dicey cricket!",
        "entities": [
            [
                31,
                39,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Huuuge appeal for lbw! But the umpire is having none of it. This was another attempted slog sweep, and Gunathilaka misses again, struck flush on the back pad. It's pitching outside leg though.",
        "entities": [
            [
                103,
                114,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Inside out cover drive all the way! What a shot by Gunathilaka.",
        "entities": [
            [
                51,
                62,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Dropped!! What a let off for Sri Lanka and Gunathilaka! Is he having a case of the Mendis's today? This was a top edge on another sweep, and it goes over the keeper's head but straight to fine leg coming in. But he gets nowhere near it, as the ball goes straight through his hands on to his chest, and then deflects to the ropes to add salt in the wounds.",
        "entities": [
            [
                43,
                54,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Rashid traps Shanaka in front! But the Sri Lankan skipper has reviewed. His only hope is that this is hitting outside the line. And it indeed is hitting outside, quality review. This was the googly, pitching outside off and striking the batter on the front pad as he looks to flick it.",
        "entities": [
            [
                13,
                20,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Short boundaries! This was pitched shorter and quicker, and Gunathilaka is able to get under it with his pull and safely clear the square leg boundary.",
        "entities": [
            [
                60,
                71,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Brilliance on the boundary from Najeeb! This is a full toss that's absolutely creamed down the ground by Shanaka. It's hit flat and hard, but Najeeb balances himself on the line and takes it, with his back foot agonisingly close to the ropes. He's then about to go over so he pops it up, and takes it once coming back inside. And yes, the third umpire has given the all clear!",
        "entities": [
            [
                105,
                112,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Gunathilaka goes for one sweep too many, and he's castled! Rashid gets his man in the end, as Gunathilaka goes across the line and misses completely. The off peg is disturbed. Is this yet another twist in this game?",
        "entities": [
            [
                0,
                11,
                "PERSON"
            ]
        ]
    },
    {
        "text": "makes room before the ball is delivered. Theekshana ends up delivering a length ball on leg and angling into the batter. Punched back",
        "entities": [
            [
                41,
                51,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Theekshana has the last laugh! Or does he? Gurbaz tries to repeat it, but he can only get the height. Theekshana bowls a carrom ball just outside off, and Gurbaz tries to loft him over his head. But he's through the shot too early, it has come off the toe-end too, and Gunathilaka runs to his left from long off to take a reverse-cup catch. But wait, drama time! Gurbaz is waiting near the boundary line because it appears like the fielder's foot may be touching the boundary skirting here. Suspense.... And oooooo, Gurbaz gets a massive reprieve! Gunathilaka stepped on the skirting while trying to settle for the catch, and the umpire says that's half a dozen more!",
        "entities": [
            [
                0,
                10,
                "PERSON"
            ]
        ]
    },
    {
        "text": "off stump pegged back! You felt like something was gonna give - either a boundary or a wicket, and it is the latter. Back of a length outside off and angling into off stump. Ball stays a shade low with Zazai trying to slog across the line. He misses, Madushanka hits.",
        "entities": [
            [
                251,
                261,
                "PERSON"
            ]
        ]
    },
    {
        "text": "deft shot! Madushanka goes short, aimed at his body. Zadran sways away but brings the bat up, and plays a ramp over the keeper's head! Nabi clapping from the pavillion.",
        "entities": [
            [
                11,
                21,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full on middle stump. Driven past the bowler to long on. Madushanka couldn't get low in time to stop it.",
        "entities": [
            [
                57,
                67,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full ball just outside off. Gurbaz gives Shanaka a charge and tries to hammer a shot over mid on. But toe-ended to the bowler's left",
        "entities": [
            [
                41,
                48,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Scooped but straight to short fine leg! This was premeditated as Ibrahim goes across the crease early. Madushanka spots the move and slows it right up. Ibrahim goes through with the stroke, but he only manages height without distance. Simple catch at fine leg.",
        "entities": [
            [
                103,
                113,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Pulled for a maximum! Madushanka lost all control of this slower ball, and it ends up almost waist high. Walloped high over deep midwicket!",
        "entities": [
            [
                22,
                32,
                "PERSON"
            ]
        ]
    },
    {
        "text": "attempted sweep, strikes the front pad as the batter misses. Theekshana appeals, but it's going well down leg.",
        "entities": [
            [
                61,
                71,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Takes a good return catch! Carrom ball outside off, and Nabi tries to flat bat this down the ground, it's straight back at Theekshana who uses every inch of his tall frame to leap over head and take the catch.",
        "entities": [
            [
                123,
                133,
                "PERSON"
            ]
        ]
    },
    {
        "text": "short and wide, and Rizwan slashes it past point for four. Poor delivery, and Rizwan gave it what it deserved",
        "entities": [
            [
                20,
                26,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a prod to Pandya again and this time Rizwan takes him on. Puts in a dive, as you'd imagine, and gets there in time. Actually, a direct hit would have seen him out",
        "entities": [
            [
                37,
                43,
                "PERSON"
            ]
        ]
    },
    {
        "text": "angling aay from off stump. Rizwan's drive finds the cover fielder",
        "entities": [
            [
                28,
                34,
                "PERSON"
            ]
        ]
    },
    {
        "text": "banged in short, which Rizwan steers to fine leg and the pair exchange ends",
        "entities": [
            [
                23,
                29,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball on the body, which is an area Rizwan excels. Smacks it off the ribs to a vacant fine leg for four.",
        "entities": [
            [
                42,
                48,
                "PERSON"
            ]
        ]
    },
    {
        "text": "wow, what a shot that was! Short ball, Rizwan gets down, bat over his head, and still manages to find the gap between backward point and short third! Phenomenally clever shot",
        "entities": [
            [
                39,
                45,
                "PERSON"
            ]
        ]
    },
    {
        "text": "that is a Rizwan special! Gets across and whips it over square leg for a huge six. That passliyon waali shot, as its known in Pakistan, is always such a sight to behold",
        "entities": [
            [
                10,
                16,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball that Nawaz crunches over long-off for a big six. He caught that clean out of the middle, and followed through the line nicely. Fairly clear what his role is here",
        "entities": [
            [
                17,
                22,
                "PERSON"
            ]
        ]
    },
    {
        "text": "another short ball, one that Nawaz pulls away to midwicket for a single",
        "entities": [
            [
                29,
                34,
                "PERSON"
            ]
        ]
    },
    {
        "text": "starts the over with a juicy full toss around off. Rizwan moves across, bends his back leg and smashes it over deep midwicket",
        "entities": [
            [
                51,
                57,
                "PERSON"
            ]
        ]
    },
    {
        "text": "dragged short, down the leg side but Rizwan misses out. Mistimes the pulls towards short fine leg. Only a single",
        "entities": [
            [
                37,
                43,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a length ball around off, was sliding away but Nawaz goes for the slog sweep and clears the deep midwicket fielder for a 76-metre six",
        "entities": [
            [
                47,
                52,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a slider, hurries onto the batter. Rizwan was first looking to come forward and then decides to flick it but misses and gets hit on the pads. Was heading down",
        "entities": [
            [
                35,
                41,
                "PERSON"
            ]
        ]
    },
    {
        "text": "goes for the yorker but ends up bowling a low full toss on the stumps. Rizwan was looking to work it on the leg side, gets a leading edge to the right of Rohit at extra cover. Kohli from mid-off cuts it off but cannot stop the second run",
        "entities": [
            [
                71,
                77,
                "PERSON"
            ]
        ]
    },
    {
        "text": "fifty for Rizwan, 100 up for Pakistan. Full around off, hits it over extra cover for a couple",
        "entities": [
            [
                10,
                16,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a full toss around off, Rizwan flicks it towards deep midwicket for one",
        "entities": [
            [
                24,
                30,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Arshdeep once again misses his yorker. This time ends up landing it on the slot, around off. Nawaz smashes it between the non-striker and stumps for four",
        "entities": [
            [
                93,
                98,
                "PERSON"
            ]
        ]
    },
    {
        "text": "finally nails the yorker. Was tailing in towards the leg stump. Nawaz looks to dig it out towards the leg side but misses and is hit on the back leg. An appeal for lbw but not given. The ball-tracking shows it was going down",
        "entities": [
            [
                64,
                69,
                "PERSON"
            ]
        ]
    },
    {
        "text": "another almost yorker. Rizwan digs it out towards short midwicket and sets off. Arshdeep fields the ball himself and nails the direct hit at the non-striker's end. Rizwan puts in the dive and is well in. Despite all the issue with his knee/leg, he was up in a jiffy and was looking for an overthrow. Not here though",
        "entities": [
            [
                23,
                29,
                "PERSON"
            ]
        ]
    },
    {
        "text": "121kph, a slower length ball following the batter who was moving towards the leg side. Rizwan places it towards midwicket and sprints back for the second",
        "entities": [
            [
                87,
                93,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full outside off and Nawaz is hurting India here. Smashes it over covers for four. Moves to 28 off just 12 balls",
        "entities": [
            [
                21,
                26,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a slower length ball in the channel, Nawaz fails to spot it and ends up playing early. Was looking to smash it over extra cover but doesn't connect",
        "entities": [
            [
                37,
                42,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Pandya goes for the yorker but it's all going Pakistan's way at the moment. Nawaz goes for the pull, is slightly late on it but the top edge sails over Pant for four more",
        "entities": [
            [
                76,
                81,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a length ball around off, 129kph. Nawaz flat-bats it towards long-off where Hooda fumbles. It doesn't result in an extra run though",
        "entities": [
            [
                34,
                39,
                "PERSON"
            ]
        ]
    },
    {
        "text": "tosses it up on the stumps, Nawaz goes for the slog sweep and hits it to the right of the deep square leg fielder",
        "entities": [
            [
                28,
                33,
                "PERSON"
            ]
        ]
    },
    {
        "text": "another tossed up delivery but this is down the leg side. Nawaz sweeps it fine on this occasions, all along the ground to the fine leg boundary. This one was a googly",
        "entities": [
            [
                58,
                63,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length outside off. Plenty of room. Rizwan rocks back and cuts it to the right of the backward point fielder, who can only watch it go to the boundary",
        "entities": [
            [
                36,
                42,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball outside off, 75kph. Rizwan pulls it towards wide long-on and sprints back for the second",
        "entities": [
            [
                32,
                38,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length outside off, Rizwan goes down on one knee and drags it towards deep midwicket",
        "entities": [
            [
                20,
                26,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a slower ball banged into the wicket, and angling across. 121kph. Nawaz was early into the pull and misses",
        "entities": [
            [
                66,
                71,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Bhuvi strikes. Short of length around off, rolled his fingers over it. Nawaz looks to go over long-off but it bounces a little extra and Hooda pouches it calmly at the boundary",
        "entities": [
            [
                71,
                76,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball Rizwan moves across early. Hardik bowls it wide outside off and Rizwan fails to connect the drag-pull",
        "entities": [
            [
                39,
                45,
                "PERSON"
            ],
            [
                12,
                18,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length and Hardik goes even wider this time but Rizwan didn't move across much on this occasion. Leaves it alone and picks up a wide",
        "entities": [
            [
                11,
                17,
                "PERSON"
            ],
            [
                48,
                54,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full, well outside off. Rizwan lofts it towards long-off but Hardik rolled his fingers over it, 129kph. That meant he didn't get the required distance on it despite middling it. Surya gobbles it up",
        "entities": [
            [
                61,
                67,
                "PERSON"
            ],
            [
                24,
                30,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball around off, pushes it to the right of short midwicket and sets off. Bishnoi charges in and underarms it towards the stumps. He misses; Khushdil was not even in the frame",
        "entities": [
            [
                147,
                155,
                "PERSON"
            ]
        ]
    },
    {
        "text": "dropped. Full outside off, Asif Ali goes for the slog sweep but ends up top-edging it towards short third. It's a dolly but think Arshdeep took a touch casually and grassed it",
        "entities": [
            [
                27,
                35,
                "PERSON"
            ]
        ]
    },
    {
        "text": "slider, dragged down. Asif Ali misses the pull but it's another wide",
        "entities": [
            [
                22,
                30,
                "PERSON"
            ]
        ]
    },
    {
        "text": "starts with a bouncer but it's way down the leg side. Khushdil was moving towards the off side and lets it go",
        "entities": [
            [
                54,
                62,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Asif Ali! A length ball around off, was a legcutter. Asif Ali goes deep and towards the off side and smashes it 92 metres over long-on",
        "entities": [
            [
                0,
                8,
                "PERSON"
            ]
        ]
    },
    {
        "text": "another slower one. Asif Ali moves across again and looks to smash it through the off side. Misses but this has been called a wide. A touch harsh and Bhuvi isn't happy",
        "entities": [
            [
                20,
                28,
                "PERSON"
            ]
        ]
    },
    {
        "text": "another slower one. A legcutter. Length outside off, Asif Ali looks to hit it towards extra cover but toe-ends it towards short third. Chahal is very fine there and stops it",
        "entities": [
            [
                53,
                61,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a bouncer and Khushdil goes for the pull. Gets a top edge and gets it to behind deep square square leg, just to the left of the fielder. One bounce and over the boundary line",
        "entities": [
            [
                14,
                22,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length outside off, Asif Ali goes over extra cover. And it just dribbles between Surya, the long-off, and Axar, the sweeper cover, for four",
        "entities": [
            [
                20,
                28,
                "PERSON"
            ]
        ]
    },
    {
        "text": "nails the yorker. Khushdil inside edges it onto his toes as he looks to dig it out. The ball rolls towards covers for one",
        "entities": [
            [
                18,
                26,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Iftikhar seals it for Pakistan. Arshdeep misses his yorker again and ends up bowling a full toss around off. Iftikhar hits it down the ground. Hooda cuts it off from long-on but slips as he is about to throw it. A weak throw means Khushdil makes it back comfortably",
        "entities": [
            [
                0,
                8,
                "PERSON"
            ]
        ]
    },
    {
        "text": "slower delivery, but KL Rahul sees it coming a mile away. Leans into a sensational off drive - no more than that, really - that sails over wide long-off. India have Pakistan's bowlers on the ropes here",
        "entities": [
            [
                24,
                29,
                "PERSON"
            ]
        ]
    },
    {
        "text": "tried to make room, and Nawaz followed him. Forced to defend",
        "entities": [
            [
                24,
                29,
                "PERSON"
            ]
        ]
    },
    {
        "text": "rush of blood to the head, banged into the pitch. Soars above Kohli and the diminutive Rizwan for five bonus runs",
        "entities": [
            [
                62,
                67,
                "PERSON"
            ]
        ]
    },
    {
        "text": "slower ball, prodded into the offside. An overthrow allows Rahul to keep the strike",
        "entities": [
            [
                59,
                64,
                "PERSON"
            ]
        ]
    },
    {
        "text": "charges down the ground, and holes to long-on. Shadab strikes off the first ball. Got to the pitch but got neither the power nor the elevation, and Mohammad Nawaz takes a smart catch",
        "entities": [
            [
                47,
                53,
                "PERSON"
            ]
        ]
    },
    {
        "text": "once more! This was a googly, and Yadav tried to play the same cut shot, and ends up beaten",
        "entities": [
            [
                34,
                39,
                "PERSON"
            ]
        ]
    },
    {
        "text": "too short, and Kohli punishes it. Picks it up early and pulls it wide of long-on to help himself to four",
        "entities": [
            [
                15,
                20,
                "PERSON"
            ]
        ]
    },
    {
        "text": "arm ball, went on with the angle. Kohli gets a stride out and defends",
        "entities": [
            [
                34,
                39,
                "PERSON"
            ]
        ]
    },
    {
        "text": "poor fielding gives India a boundary. Thick outside edge from Kohli leapt up and dropped just short of Naseem, who went for a catch that was never on and watches the ball go away for four",
        "entities": [
            [
                62,
                67,
                "PERSON"
            ]
        ]
    },
    {
        "text": "drops this short, and Kohli drives it to long-off",
        "entities": [
            [
                22,
                27,
                "PERSON"
            ]
        ]
    },
    {
        "text": "holes out to square leg this time. Yadav made no attempt to keep that down, and the top edge meant it was straight down Asif Ali's throat. Promising little flutter of an innings comes to an end",
        "entities": [
            [
                35,
                40,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a length ball on the stumps and coming in. Kohli places it towards short midwicket and sets off. Pant takes a couple of steps down as well before sending Kohli back. The fielder has a shy at the keeper's end but misses. Kohli, though, would have been home",
        "entities": [
            [
                43,
                48,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Hasnain goes short and Kohli takes him on. Swivels him to the deep square leg boundary for four",
        "entities": [
            [
                23,
                28,
                "PERSON"
            ]
        ]
    },
    {
        "text": "walks at the bowler but Nawaz shortens his length. Flicked towards short midwicket",
        "entities": [
            [
                24,
                29,
                "PERSON"
            ]
        ]
    },
    {
        "text": "99kph. Pant goes down the track again but it's short of length on the stumps from Nawaz. Flicked towards short fine leg",
        "entities": [
            [
                82,
                87,
                "PERSON"
            ],
            [
                7,
                11,
                "PERSON"
            ]
        ]
    },
    {
        "text": "another quicker one, 97kph. On a length on the stumps, Pant flicks it towards short midwicket",
        "entities": [
            [
                55,
                59,
                "PERSON"
            ]
        ]
    },
    {
        "text": "starts with a length ball outside off. Kohli skips down the track, slightly towards the leg side and creams it past the diving extra cover fielder on the up. To the left of the fielder",
        "entities": [
            [
                39,
                44,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a slower bouncer. Kohli was looking to pull it but delays the shot and drags it towards midwicket. Comes back for the second",
        "entities": [
            [
                18,
                23,
                "PERSON"
            ]
        ]
    },
    {
        "text": "down the track but Naseem has bowled this on a hard length at the stumps. Kohli dabs it towards cover",
        "entities": [
            [
                74,
                79,
                "PERSON"
            ]
        ]
    },
    {
        "text": "down the track but it's hard length at the stumps. Kohli pushes it towards long-on",
        "entities": [
            [
                51,
                56,
                "PERSON"
            ]
        ]
    },
    {
        "text": "dances down but Shadab has bowled it full on the leg stump. Pant almost gets yorker. Digs it out towards long-on",
        "entities": [
            [
                16,
                22,
                "PERSON"
            ],
            [
                60,
                64,
                "PERSON"
            ]
        ]
    },
    {
        "text": "down the track and looks to smash this over the bowler's head but it was a googly from Shadab. Gets an outside edge and it races to the right of short third for four",
        "entities": [
            [
                87,
                93,
                "PERSON"
            ]
        ]
    },
    {
        "text": "taken at backward point. Another googly from Shadab but this time he bowled it on a length outside leg. Pant went for the reverse sweep but ended up mistiming it straight to the fielder",
        "entities": [
            [
                45,
                51,
                "PERSON"
            ],
            [
                104,
                108,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length outside off, Kohli skipped out of his crease and slashed at it. Got it over the point fielder off the outer half of the bat. A wayward throw means Kohli comes back for the second",
        "entities": [
            [
                20,
                25,
                "PERSON"
            ]
        ]
    },
    {
        "text": "short of length around off, Kohli gives him a wee bit of room by moving towards the leg side. Pulls it down towards deep midwicket",
        "entities": [
            [
                28,
                33,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a bouncer to welcome the new batter. Hooda looks to ramp it over the keeper's head but misses. Rizwan leaps to collect it but it flies over him. But he lands awkwardly on his right leg and is in some pain. He is flat on his back. The physio is out to have a look. Rizwan is up on his feet but is limping... And he is ready to keep again after a bit of stretching",
        "entities": [
            [
                37,
                42,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length but width outside off, Kohli cuts it towards deep point for a couple",
        "entities": [
            [
                30,
                35,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full around off, turning away slightly. Kohli pushes it to the right of the cover fielder",
        "entities": [
            [
                40,
                45,
                "PERSON"
            ]
        ]
    },
    {
        "text": "tossed up outside off. Too full and Hooda had to dig it out. Ends up miscuing it towards short third but lands well short of the fielder",
        "entities": [
            [
                36,
                41,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a googly from well outside off, turning big and extracting extra bounce as well. Hooda went for the sweep but got beaten",
        "entities": [
            [
                81,
                86,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball around off, holds its line. Kohli was looking to work it on the leg side but gets it towards mid-off off the outer half of the bat",
        "entities": [
            [
                40,
                45,
                "PERSON"
            ]
        ]
    },
    {
        "text": "superb shot. Full on the stumps, Hooda steps towards the leg side and hits it inside out through extra cover for four",
        "entities": [
            [
                33,
                38,
                "PERSON"
            ]
        ]
    },
    {
        "text": "151kph. That hard length around middle and off. Hurries onto the batter and Kohli can only defend it back",
        "entities": [
            [
                76,
                81,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a slower one at 133kph!. 18kph slower than the previous ball. Full around off. Kohli flicks it towards wide long-on and sprints back for the second",
        "entities": [
            [
                79,
                84,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length but angling down the leg side. Hooda looks to help it fine but misses",
        "entities": [
            [
                38,
                43,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball around off, Hooda clears his front leg and looks to go over mid-off. Didn't middle it but got enough to clear the mid-off fielder. 150kph this one was. India go past 150",
        "entities": [
            [
                24,
                29,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Hasnain goes short, Hooda arches back and plays a falling ramp over the keeper. Gets appreciation from Kohli",
        "entities": [
            [
                20,
                25,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full outside off, Hooda scythes it over point for one",
        "entities": [
            [
                18,
                23,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length outside off, a casual waft from Kohli. Gets beaten",
        "entities": [
            [
                39,
                44,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Kohli gets to his fifty in style. 149kph but it's full around off. Kohli moves towards the off side and whips it over deep midwicket for six",
        "entities": [
            [
                0,
                5,
                "PERSON"
            ]
        ]
    },
    {
        "text": "short outside off, Hooda leaps up and looks to upper cut it but it's bowled 117kph. That means Hooda fails to middle it. A single to deep third",
        "entities": [
            [
                19,
                24,
                "PERSON"
            ]
        ]
    },
    {
        "text": "another slower one. Banged into the middle of the pitch, on middle and leg. Kohli was down the ground and towards the leg side. Ends up dragging it behind square leg. Kohli is really sprinting back for the second even though Hooda is saying no. Hooda had to relent in the end as Kohli was already three-fourth of the way down",
        "entities": [
            [
                76,
                81,
                "PERSON"
            ]
        ]
    },
    {
        "text": "back-of-the-hand slower one. A length ball around off, Hooda looks to smash it over long-on but gets more height than distance and Nawaz settles under it near wide long-on area. Falls back as he completes the catch",
        "entities": [
            [
                55,
                60,
                "PERSON"
            ]
        ]
    },
    {
        "text": "here's the yorker but just misses his mark. Kohli moves across and works it towards midwicket. He wants two and gets two",
        "entities": [
            [
                44,
                49,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full on the stumps, 144kph. Kohli nudges it towards long-on for one. Think he wanted to keep strike",
        "entities": [
            [
                28,
                33,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a slower length ball, well outside off. Kohli looks to pull it from there but gets an under edge that bounces towards the keeper",
        "entities": [
            [
                40,
                45,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a length ball outside off, Kohli goes for the pull but ends up playing early. Mistimes it towards deep midwicket but refuses the single",
        "entities": [
            [
                27,
                32,
                "PERSON"
            ]
        ]
    },
    {
        "text": "an excellent yorker. Right in the blockhole. Kohli gets his bat down in time but can only dig it out onto his foot. Was bowled at 150kph",
        "entities": [
            [
                45,
                50,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Rauf goes for the another yorker but misses his mark this time. Ends up bowling a low full toss that Kohli flicks it towards deep square leg. He is charging back for the second, even puts in the dive but cannot beat the direct hit from Asif Ali",
        "entities": [
            [
                101,
                106,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Searches for the glory ball now and is close to getting it. Yorker length on middle, shaping into the batter. He digs it to mid-on and sets off. The fielder has a shy at the stumps and Mendis was gone for all money had that hit.",
        "entities": [
            [
                185,
                191,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Ah, ruins a good over. Banged in short but down leg, Nissanka helps it past the keeper.",
        "entities": [
            [
                53,
                61,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Full-length delivery, was the knuckle ball again. Nissanka spots it this time and works it to deep midwicket, who was sent back just before this ball.",
        "entities": [
            [
                50,
                58,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Finds the hard length right away. Nissanka looks to scoop it away first ball, but Hardik rolled his fingers well on the ball. The ball goes just over the stumps",
        "entities": [
            [
                82,
                88,
                "PERSON"
            ],
            [
                34,
                42,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Follows Nissanka with an on-pace delivery as the batter gives himself room. But Nissanka is up to the task and lofts him straight through the line over mid-on and over the ropes",
        "entities": [
            [
                8,
                16,
                "PERSON"
            ]
        ]
    },
    {
        "text": "He's hitting the hard lengths here. Cramps him for room this time as Mendis can only fend it back to the bowler",
        "entities": [
            [
                69,
                75,
                "PERSON"
            ]
        ]
    },
    {
        "text": "In the slot outside off and Nissanka pummels it over mid-off. Was a slower ball again but there was a lot of width for Nissanka to free his arms",
        "entities": [
            [
                28,
                36,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Oh, that is a shot and a half! Slower short ball that sat up to be hit and Mendis obliged by smoking it over deep midwicket and way into the stands",
        "entities": [
            [
                75,
                81,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Short, wide, and was there to be hit. Nissanka does not miss out. Goes back and smashes it through covers",
        "entities": [
            [
                38,
                46,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Ah, beats him in the flight completely but Mendis adjusts in the end. Tossed up gently outside off, 75 kph. Mendis is down the track, and beaten completely. But somehow finds and edge to short third man. End of a top powerplay.",
        "entities": [
            [
                43,
                49,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Length outside off, goes wide of a crease does Pandya. Mendis stands tall and flays it to deep point",
        "entities": [
            [
                55,
                61,
                "PERSON"
            ]
        ]
    },
    {
        "text": "carrom ball on off, he taps it to the right of the bowler. A bit of a hesitation but Ashwin is unable to reach the ball and they complete a run",
        "entities": [
            [
                85,
                91,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Fifty up for Nissanka. What a knock this has been. Length on off, pushed to long on for a run",
        "entities": [
            [
                13,
                21,
                "PERSON"
            ]
        ]
    },
    {
        "text": "hurries the batter with a back of a length delivery but Mendis still manages to fend it to cover and collect a run",
        "entities": [
            [
                56,
                62,
                "PERSON"
            ]
        ]
    },
    {
        "text": "There's the first wicket! Flighted ball outside leg, he goes for the reverse sweep looking to clear the in-field. But he cannot keep it down or find the gap and finds Rohit Sharma at backward point. But what a knock this was by Nissanka. Has set the chase up brilliantly.",
        "entities": [
            [
                228,
                236,
                "PERSON"
            ]
        ]
    },
    {
        "text": "In the aiiiir and a second wicket in the over! Is there a way back for India? Flighted gently on middle. He goes for the hard sweep, gets a top edge and Suryakumar at deep backward square completes a simple catch. Chahal is pumped.",
        "entities": [
            [
                214,
                220,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Mendis is doing this so well! Slower bouncer outside off, but that once again just sits up. Mendis ramps it past short third man for a four. Brings up his fifty with that",
        "entities": [
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Flighted on middle and leg, he taps it to the on side and sets off. But Pant is onto it in a flash and Gunathilaka has to dive in to make it back.",
        "entities": [
            [
                103,
                114,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Another one for Chahal? Yes, the umpire's finger goes up and it is the big wicket of Mendis. Slider on middle stump, he goes back but is beaten by the pace of it. Is struck right in front of the stumps. Mendis reviews but more in hope than anything. He is walking off even before the third umpire's decision. Impact in line and the ball would have clattered into leg stump.",
        "entities": [
            [
                16,
                22,
                "PERSON"
            ],
            [
                85,
                91,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Just evades a leaping Kohli at point. Flighted outside off, beats him in the flight completely. Rajapaksa looks to loft it over covers, can only slice it but the ball beats the fielder.",
        "entities": [
            [
                96,
                105,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Slower back of a length ball outside off, he looks to cut it hard and misses it completely. Did not get enough room there. Hardik asks Pant whether he heard a sound. Nothing from Pant, though.",
        "entities": [
            [
                123,
                129,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Unlucky Hardik! Slower back of a length ball outside off, he looks to force it away through covers, gets a thick outside edge that just goes past a diving Pant to his right.",
        "entities": [
            [
                8,
                14,
                "PERSON"
            ]
        ]
    },
    {
        "text": "142 kph, so Hardik is steaming in alright. Length on leg, Shanaka goes for a wild slog, misses and the balls squeaks past the stumps",
        "entities": [
            [
                12,
                18,
                "PERSON"
            ],
            [
                58,
                65,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Full toss outside off, and this time Shanaka gets enough bat on it and thumps it to the deep cover fence. The 50 partnership comes up in 29 balls.",
        "entities": [
            [
                37,
                44,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Yorker outside off, he digs it to extra cover. But Shanaka has done his job.",
        "entities": [
            [
                51,
                58,
                "PERSON"
            ]
        ]
    },
    {
        "text": "All over! Sri Lanka win with one ball to spare. They hold their nerves at a clutch stage, India...don't. Back of a length outside off, he shapes up for the cut but makes no connection with the ball going to Pant. He had all three stumps to aim at with the batter nowhere in the frame. He misses. The ball rolls to Arshdeep who has a chance to run Shanka out at the non-striker's end. He misses too, and they run back for two. Shanaka lost his bat while taking the first run but he scampers back, no bat in hand, puts in the dive and makes it. Arms aloft, he is all smiles. SL win by six wickets and have a foot in the final.",
        "entities": [
            [
                426,
                433,
                "PERSON"
            ]
        ]
    },
    {
        "text": "oh it swings right up but perhaps the 139ks means he gets his bat down in time. And this is swing away from around leg. Rahul gets a single off the outside edge. Can he swing it in?",
        "entities": [
            [
                120,
                125,
                "PERSON"
            ]
        ]
    },
    {
        "text": "fuller, but no swing, Rahul defends outside off",
        "entities": [
            [
                22,
                27,
                "PERSON"
            ]
        ]
    },
    {
        "text": "massive swing back in and given lbw even though he has skipped down the wicket. They have reviewed it. It is drifting in just like an arm ball but in the opposite direction. Rahul is completely flummoxed. It looks like it has beaten the inside edge and laned on the toe. Has it swung too much? Hang on, there is a sound signature as the ball passes the bat, but it looks like it is the bat hitting the boot. The third umpire says the same. And the ball tracker shows it is clipping leg. Rahul has to walk back",
        "entities": [
            [
                174,
                179,
                "PERSON"
            ]
        ]
    },
    {
        "text": "again the reverse arm ball, swinging in as opposed to out. Kohli defends it back to him",
        "entities": [
            [
                59,
                64,
                "PERSON"
            ]
        ]
    },
    {
        "text": "the ball is stopping here. Kohli shapes up for a punch, but the ball holds in the pitch and bounces extra. Hit uppishly towards mid-off",
        "entities": [
            [
                27,
                32,
                "PERSON"
            ]
        ]
    },
    {
        "text": "appeal for lbw, not given, but Kohli is confounded it is not called a wide. The umpire waits for the 15 seconds for the review to end and then calls it a wide. That is a strange one. This is a yorker, barely missing leg. Called wide",
        "entities": [
            [
                31,
                36,
                "PERSON"
            ]
        ]
    },
    {
        "text": "no need to wait for the 15 seconds here. His stumps are flattened. Kohli is playing according to the team plan, looking to capitalise on the field restrictions. Looking to slog a length ball over midwicket but it seams back in a touch and both his off and middle stumps are on the ground",
        "entities": [
            [
                67,
                72,
                "PERSON"
            ]
        ]
    },
    {
        "text": "down the wicket, Madushanka goes wide, and Rohit still slashes at it. In the air it goes, but lands short of the advancing deep point",
        "entities": [
            [
                17,
                27,
                "PERSON"
            ]
        ]
    },
    {
        "text": "incredible shot. Surya's wrists are incredible. He is shimmying, and Madushanka goes short. There is no room available, but he upper-cuts it. Deep third is taken aback after charging in for the catch. He tracks back, but it still goes over him",
        "entities": [
            [
                69,
                79,
                "PERSON"
            ]
        ]
    },
    {
        "text": "on a length, no room, pushed back to Shanaka",
        "entities": [
            [
                37,
                44,
                "PERSON"
            ]
        ]
    },
    {
        "text": "doesn't look Pant is struggling, though. Gets the width and the pace on a short-of-length delivery, and cuts it through point for four",
        "entities": [
            [
                13,
                17,
                "PERSON"
            ]
        ]
    },
    {
        "text": "wide down the leg side. Pant looks to help it over short fine but gets no touch on it",
        "entities": [
            [
                24,
                28,
                "PERSON"
            ]
        ]
    },
    {
        "text": "fires this in short, and Pant pulls him through to deep square leg for his third boundary in five balls. All three off the back foot",
        "entities": [
            [
                25,
                29,
                "PERSON"
            ]
        ]
    },
    {
        "text": "slows this one down, and Pant bunts the length ball into the leg side for one",
        "entities": [
            [
                25,
                29,
                "PERSON"
            ]
        ]
    },
    {
        "text": "the ramp is probably not the smartest shot on this pitch. Shanaka digs one in, Hooda plays his favourite shot, and is caught at short third. But now that he has been caught, they can check it for a no-ball on height. Remember the wide ball earlier in the over was one bouncer for the over. If this is above his shoulder, this will be a no-ball. And it is above Hooda's shoulder even when he is off his feet. What looks like a wicket is a no-ball. Had this cleared short third, they wouldn't have been able to check if this is a no-ball. Remember readers, don't outrage over this. They checked the no-ball because there was a dismissal. These are the rules. Don't go by emotional commentators on TV",
        "entities": [
            [
                58,
                65,
                "PERSON"
            ],
            [
                79,
                84,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Hooda shuffles across early to look to go over short fine, giving Madushanka a full view of the stumps. Madushanka bowls a length ball, and Hooda is early into the shot. The middle stumps goes for a walk",
        "entities": [
            [
                66,
                76,
                "PERSON"
            ],
            [
                0,
                5,
                "PERSON"
            ]
        ]
    },
    {
        "text": "big big wicket. This could be worth 10 runs. Slower short ball, Pant still goes hard trying to pull it for a six, but he has found deep midwicket, one of only four fielders outside the circle. Superb delivery. Legcutter slower bouncer. really difficult ball to execute",
        "entities": [
            [
                64,
                68,
                "PERSON"
            ]
        ]
    },
    {
        "text": "yorker, Ashwin digs it out wide of deep midwicket, comes back for two. That extra fielder inside the circle has got them the extra run",
        "entities": [
            [
                8,
                14,
                "PERSON"
            ]
        ]
    },
    {
        "text": "yorker again, jams under Ashwin's bat. Just the single to point",
        "entities": [
            [
                25,
                31,
                "PERSON"
            ]
        ]
    },
    {
        "text": "lovely slower yorker, dipping on him, Bhuvneshwar can't even get bat on it",
        "entities": [
            [
                38,
                49,
                "PERSON"
            ]
        ]
    },
    {
        "text": "slower ball, no room, but Ashwin makes room and somehow finds the gap between point and cover-point. Gets two",
        "entities": [
            [
                26,
                32,
                "PERSON"
            ]
        ]
    },
    {
        "text": "on-pace, short ball, into the body, cramps him up, Ashwin can get just the single to long-on",
        "entities": [
            [
                51,
                57,
                "PERSON"
            ]
        ]
    },
    {
        "text": "slower ball, Bhuvneshwar delays the downswing but not enough. It is still too slow for his slog, and the middle stump is pegged back and leg stump flattened",
        "entities": [
            [
                13,
                24,
                "PERSON"
            ]
        ]
    },
    {
        "text": "wow Ashwin. Ashsix. He has cleared the biggest boundary of the ground. Karunaratne gets greedy and bowls an on-pace length ball. Ashwin takes on the boundary that Pandya failed to clear. And he has timed this beautifully",
        "entities": [
            [
                4,
                10,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball on the stumps, Rizwan picks it up and sends it over long leg for the first six of the Pakistan innings",
        "entities": [
            [
                27,
                33,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a low full toss outside off, Rizwan mistimes it towards mid-off as he attempts a drive",
        "entities": [
            [
                29,
                35,
                "PERSON"
            ]
        ]
    },
    {
        "text": "attempts a slower one but it ends up as a low full toss around off. Rizwan waits for it before flicking it through square leg for four",
        "entities": [
            [
                68,
                74,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a length ball outside off and angling in. Iftikhar pushes at it, gets an inside edge past the stumps. Lucky to get four there",
        "entities": [
            [
                42,
                50,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball around off, punched to the left of mid-on. The fielder let go of the ball quickly. A dive from Rizwan to make the ground. No direct hit though",
        "entities": [
            [
                107,
                113,
                "PERSON"
            ]
        ]
    },
    {
        "text": "that should release some pressure. Short of length around off, Iftikhar transfers the weight back and pulls it through midwicket for four",
        "entities": [
            [
                63,
                71,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length but down the leg side. Rizwan looks to sweep it fine but misses. A leg bye to short fine leg",
        "entities": [
            [
                30,
                36,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a googly. Full around off, Iftikhar pushes at it, gets an inside edge towards short fine leg",
        "entities": [
            [
                27,
                35,
                "PERSON"
            ]
        ]
    },
    {
        "text": "a huge appeal for lbw but not given. Afghanistan, though, want to review it. It was a googly from Rashid, pitching well outside off. Rizwan came forward to defend, got beaten on the inside edge but I feel the impact was outside off. And the ball-tracking confirms as much",
        "entities": [
            [
                133,
                139,
                "PERSON"
            ]
        ]
    },
    {
        "text": "given lbw but Rizwan wants to review this. Another googly from Rashid, pitching outside off and hurrying the batter. Rizwan was on the back foot, looking to flick it but missed and was struck in front of middle. The ball-tracking shows it would have gone on to hit the leg stump. That's a huge wicket",
        "entities": [
            [
                14,
                20,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length outside off, kept a touch low. Shadab goes for the cut but misses",
        "entities": [
            [
                38,
                44,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Out of the ground! What a hit from Shadab. This was the quicker ball, back of a length and Shadab gets right under this with the slog sweep. 97 meters!",
        "entities": [
            [
                35,
                41,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Low full toss, swatted over midwicket! Another clean hit from Shadab, as Nabi once more misses his length.",
        "entities": [
            [
                62,
                68,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Around the wicket now, and Shadab brings out the conventional sweep now. It's wide of square leg too, and they hare for a couple",
        "entities": [
            [
                27,
                33,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Wow, another huuuuge strike from Shadab! This is in the slot, and Shadab just clears the front foot and swings right through, launching it over long on",
        "entities": [
            [
                33,
                39,
                "PERSON"
            ]
        ]
    },
    {
        "text": "slightly shorter, and Shadab looks to pull this behind square, but there's sharp turn and it ends up hitting the batter on the body",
        "entities": [
            [
                22,
                28,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Short and pulled straight into gleeful hands of deep midwicket! This was the slower ball, and it sounded clean off Iftikhar's bat, but he just couldn't get the distance",
        "entities": [
            [
                115,
                123,
                "PERSON"
            ]
        ]
    },
    {
        "text": "slog sweep over square leg! This is not quite on a good length and Shadab gets right under it.",
        "entities": [
            [
                67,
                73,
                "PERSON"
            ]
        ]
    },
    {
        "text": "But Rashid has the last laugh! This is again tossed up outside off - brave from Rashid considering the result last ball - but this time it's the leg spinner. Shadab looks to smash this down towards long-off, but only manages a thick looping outside edge to short third man",
        "entities": [
            [
                158,
                164,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Chopped on! Game on! Another fuller length ball outside off, not quite a yorker and Khushdil goes for the drive. But a little deviation off the pitch catches the inside edge on the way to the base of the stumps! What an over from Farooqi",
        "entities": [
            [
                84,
                92,
                "PERSON"
            ]
        ]
    },
    {
        "text": "And he's done it! Another missed yorker, another smack over long off! Wild scenes as Naseem Shah is beside himself! Afghanistan are absolutely shattered! What a game of cricket, what a tournament, as Pakistan join Sri Lanka in the finals of the Asia Cup 2022!",
        "entities": [
            [
                85,
                96,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Whipped over deep midwicket! That's the first six off Shadab's bowling this tournament, and what a hit it is. Clears the front leg, and whips this over the man in the deep.",
        "entities": [
            [
                54,
                60,
                "PERSON"
            ]
        ]
    },
    {
        "text": "sharp turn away beats Zadran, who's looking to work this on the offside square",
        "entities": [
            [
                22,
                28,
                "PERSON"
            ]
        ]
    },
    {
        "text": "it's the traditional leg spinner now, and Zadran misses as he looks for a big swipe across",
        "entities": [
            [
                42,
                48,
                "PERSON"
            ]
        ]
    },
    {
        "text": "And now Shadab gets his man! The pressure being imparted by Pakistan has meant Afghanistan were forced to target Shadab, and the spinner responds to that early six with all his variations. This is the pick of the punch as it's quicker, seam up, and Zadran is unable to get the distance on this loft over long-on. It goes high, but straight down the gullet of the man in the deep!",
        "entities": [
            [
                8,
                14,
                "PERSON"
            ],
            [
                249,
                255,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Launched over the covers for a maximum! Shadab tosses this up outside off, inviting Ibrahim to go for the big shot, and he certainly obliges with this sumptuous aerial drive.",
        "entities": [
            [
                40,
                46,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Another in swinger and another lbw! This is given but Zadran reviews. It looked dead though and the replays prove it. This was full on the stumps, and swinging in towards middle and leg. Afghanistan are folding fast here.",
        "entities": [
            [
                54,
                60,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Chipped to cover! And that's a five-for for Bhuvneshwar. This was a slower knuckle ball, that catches the batter early on the drive. It's one of the easiest catches Dinesh Karthik will ever take.",
        "entities": [
            [
                44,
                55,
                "PERSON"
            ]
        ]
    },
    {
        "text": "nipping in from outside off, and the batter just about keeps this out. End of a cracking spell from Bhuvneshwar.",
        "entities": [
            [
                100,
                111,
                "PERSON"
            ]
        ]
    },
    {
        "text": "good length on the stumps, pushed back to Ashwin",
        "entities": [
            [
                42,
                48,
                "PERSON"
            ]
        ]
    },
    {
        "text": "comes down the track, Ashwin seeing this bowls it a touch slower and wider. The batter manages to stretch and drive this down to long off",
        "entities": [
            [
                22,
                28,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Fielded! Back foot punch down the ground and Hooda dives full length to his right to save the run.",
        "entities": [
            [
                45,
                50,
                "PERSON"
            ]
        ]
    },
    {
        "text": "What a shot! Telegraphs this, and Ashwin slides it down leg, but Mujeeb goes for the reverse hit anyway and connects, into space over extra cover!",
        "entities": [
            [
                34,
                40,
                "PERSON"
            ],
            [
                65,
                71,
                "PERSON"
            ]
        ]
    },
    {
        "text": "worked past short fine, comes back for two. Kohli needs 32 in four overs for a hundred",
        "entities": [
            [
                44,
                49,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Mujeeb is too far in. Pant completely mistimes the hook of a slower bouncer, but Mujeeb is caught running back, and gets only a hand to it at fine leg",
        "entities": [
            [
                22,
                26,
                "PERSON"
            ]
        ]
    },
    {
        "text": "wide yorker. Perhaps just short of it. That's all Kohli needs to steer it past point for four. He is at his best when he has had his eye in by the time the death overs arrive",
        "entities": [
            [
                50,
                55,
                "PERSON"
            ]
        ]
    },
    {
        "text": "it's all going Kohli's way. Walks at him again, Farooqi digs it in, Kohli looks to go over mid-off still, but gets a thick edge over short third",
        "entities": [
            [
                15,
                20,
                "PERSON"
            ]
        ]
    },
    {
        "text": "another drop. Afghanistan having a shocker in the field. Slower bouncer, Pant gets a massive top edge, Mujeeb runs in from long leg, but it goes through his hands",
        "entities": [
            [
                73,
                77,
                "PERSON"
            ]
        ]
    },
    {
        "text": "now he is just showing off. This is vintage Kohli at the death. Dances down the track, gets under a slower length ball and sends it sailing over long-off",
        "entities": [
            [
                44,
                49,
                "PERSON"
            ]
        ]
    },
    {
        "text": "no-look six. Slower short ball, sits up to be hit, and he sends it smack over deep square. What fun Kohli is having",
        "entities": [
            [
                100,
                105,
                "PERSON"
            ]
        ]
    },
    {
        "text": "What can Afghanistan do to stop him? He goes for the yorker on off, misses his length a little, and Kohli makes room to cover-drive this wide of extra cover and hard",
        "entities": [
            [
                100,
                105,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Kohli is looking for the wide, but he is down the track so this bouncer is allowed to stay",
        "entities": [
            [
                0,
                5,
                "PERSON"
            ]
        ]
    },
    {
        "text": "the slip cordon is in play! And pretty much the near-perfect start for Pakistan. The aggressive Kusal Mendis pokes at a short-ish ball that was seaming away from him. Played away from his body, takes the edge, and it floats into the hands of first slip.",
        "entities": [
            [
                102,
                108,
                "PERSON"
            ]
        ]
    },
    {
        "text": "good length ball, fourth-stump line. Nissanka taps it from near his chest to the off side",
        "entities": [
            [
                37,
                45,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Rizwan snaps this up! And he's displayed some mega air time diving to his left and taking it from where first slip was. Rauf bowls a nothing delivery. Short and wide, and angling away. Gunathilaka tried to set the tone by hitting a cut square, but the extra bounce induces the edge, and if there was any doubts over Rizwan's mobility, those doubts are buried!",
        "entities": [
            [
                185,
                196,
                "PERSON"
            ]
        ]
    },
    {
        "text": "no boundaries yet in three overs as Hasnain produces another tidy over. Yorker that was nearly perfect, bowled at 147kph, aimed at the base of middle, but Nissanka is up to task. Dug away to the leg side",
        "entities": [
            [
                155,
                163,
                "PERSON"
            ]
        ]
    },
    {
        "text": "counter-attacking! Full ball swinging into his pads, and Nissanka offers a flourish of his wrists to hammer a flicked shot behind square for four.",
        "entities": [
            [
                57,
                65,
                "PERSON"
            ]
        ]
    },
    {
        "text": "the incoming player into the XI is not having a good start as Nissanka deposits another four, this time in front of square on the leg side. Short-ish ball, but not having the bounce of the other two bowlers. Nissanka swivels and pulls along the ground through midwicket",
        "entities": [
            [
                62,
                70,
                "PERSON"
            ]
        ]
    },
    {
        "text": "gets in position early! Short ball, on off, Nissanka pirouettes on his toes and pulls it to the region behind square on the leg side. Again rolling his wrists to ensure it goes over the square-leg umpire",
        "entities": [
            [
                44,
                52,
                "PERSON"
            ]
        ]
    },
    {
        "text": "rotating the strike well in this over, these two. Full ball just outside off. Flays a drive behind square, although he tried to play it towards cover. Rauf at deep point delivers a flat throw at the top of the stumps at the batter's end, but Rajapaksa is in",
        "entities": [
            [
                242,
                251,
                "PERSON"
            ]
        ]
    },
    {
        "text": "good length ball on off. Googly going away. Rajapaksa tries to cut and very nearly chops it onto his stumps!",
        "entities": [
            [
                44,
                53,
                "PERSON"
            ]
        ]
    },
    {
        "text": "high-risk, high-reward! Tosses it up a bit more. Full, and a bit wide outside off. Rajapaksa gets low, down on one knee, and slogs it to deep midwicket for half a dozen. Clattered it even before we could see which direction the ball was turning.",
        "entities": [
            [
                83,
                92,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full ball on middle. Googly turns away slightly with Rajapaksa trying to poke at it. Whizzing past the edge but no impact. Caught behind appeal turned down",
        "entities": [
            [
                53,
                62,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Rajapaksa gets a life! Full ball on off and middle. Batter comes down the track to drive. Ball goes past the edge with the arm, and Rizzy can't grab it on his first attempt! Would've definitely been stumped out had Rizwan's grab been better",
        "entities": [
            [
                0,
                9,
                "PERSON"
            ]
        ]
    },
    {
        "text": "dances down the track! And smacks it over the fielder trying to take a catch at deep midwicket. Tosses it up, and since Nissanka charged him, it ends up being a full toss. Hammered!",
        "entities": [
            [
                120,
                128,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Qadir gets away with this poor ball. Full toss, quite wide. Nissanka flat-bats it to long on, mistimed.",
        "entities": [
            [
                60,
                68,
                "PERSON"
            ]
        ]
    },
    {
        "text": "wickettttttttttt! And the wristspinner breaks the 51-run partnership. Tosses it up, just outside off. Rajapaksa tries the slog sweep against the googly, but he's only got the elevation. Deep midwicket runs in, keeps his eyes on the ball, and that's SL four down!",
        "entities": [
            [
                102,
                111,
                "PERSON"
            ]
        ]
    },
    {
        "text": "top legspinner's ball! Full on middle. Just a bit of turn away. Nissanka gets forward to fend, but the ball goes past the edge, and just over off stump! Nissanka falls over after being bamboozled, and Rizwan takes the bails off. Is he stumped? They want to check..... Nissanka is safe.",
        "entities": [
            [
                64,
                72,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Nawaz bowls out and finishes his spell conceding only 21. Fullish on off. Bit of extra bounce with Nissanka trying to get forward to meet it. Hits him, rolls away to short third",
        "entities": [
            [
                0,
                5,
                "PERSON"
            ],
            [
                99,
                107,
                "PERSON"
            ]
        ]
    },
    {
        "text": "yorker doesn't come off, and Shanaka gets a big one! Full ball on off stump. Pretty much #InTheSlot for Shanaka, and he clobbers a six over wide long on",
        "entities": [
            [
                29,
                36,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball on off. Nissanka backs away and mows a flat-batted shot to Fakhar at long on",
        "entities": [
            [
                20,
                28,
                "PERSON"
            ]
        ]
    },
    {
        "text": "slower ball does the trick and once again two Pakistan fielders nearly collide while taking a catch. Takes the pace off, full ball just outside off. Shanaka looks to tee off over Hasnain's head, but can only sky this shot. Hasan and Iftikhar are both running in from long on and long off to take the catch, and neither are looking at the other. They both take a tumble, but we see that Hasan has the ball safely in his grasp.",
        "entities": [
            [
                149,
                156,
                "PERSON"
            ]
        ]
    },
    {
        "text": "looks for the reverse sweep, Theekshana keeps attacking the stumps, gets extra bounce too, concedes just one leg-bye",
        "entities": [
            [
                29,
                39,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Hasaranga strikes right back. He shortens the length this time, Iftikhar still tries the slog-sweep, and might have connected still, but the ball stays low and deflects off his pad onto the wicket",
        "entities": [
            [
                64,
                72,
                "PERSON"
            ]
        ]
    },
    {
        "text": "smart bowling. Dug in and wide outside off, away from Nawaz's reach. Good comeback",
        "entities": [
            [
                54,
                59,
                "PERSON"
            ]
        ]
    },
    {
        "text": "he backs away, Madushanka follows him with a yorker, but Nawaz has managed to put it in a hole deep on the leg side",
        "entities": [
            [
                15,
                25,
                "PERSON"
            ],
            [
                57,
                62,
                "PERSON"
            ]
        ]
    },
    {
        "text": "this is right in the slot, he clears the front leg and drives this clean over long-off. Nawaz is giving himself something to bowl at",
        "entities": [
            [
                88,
                93,
                "PERSON"
            ]
        ]
    },
    {
        "text": "goes back and across, pulls this to deep midwicket, and risks a second. Nawaz dives in, but he falls short. Lovely throw on the top of the stumps",
        "entities": [
            [
                72,
                77,
                "PERSON"
            ]
        ]
    },
    {
        "text": "finally, we have the first legitimate ball. It's swiped towards the onside and Rizwan gets a single",
        "entities": [
            [
                79,
                85,
                "PERSON"
            ]
        ]
    },
    {
        "text": "this held its line, and Rizwan defends",
        "entities": [
            [
                24,
                30,
                "PERSON"
            ]
        ]
    },
    {
        "text": "poor ball, but poorer shot, and a fantastic catch at short fine! Babar Azam's wretched Asia Cup comes to an end with a shot that encapsulates his tournament. It was tailing down leg, and Babar looked to help it towards the fine leg boundary, but directed it straight at fine leg, who jumped to hang on to a good catch",
        "entities": [
            [
                65,
                75,
                "PERSON"
            ]
        ]
    },
    {
        "text": "short ball on the body. Rizwan pulls it aerially through midwicket for a couple. Didn't get all of it, mind",
        "entities": [
            [
                24,
                30,
                "PERSON"
            ]
        ]
    },
    {
        "text": "slapped over cover, and this one's in the gap in the offside. A much needed boundary from Iftikhar",
        "entities": [
            [
                90,
                98,
                "PERSON"
            ]
        ]
    },
    {
        "text": "slightly back of a length. It's nudged into the onside towards long-on. Rizwan briefly believed two was on, but Sri Lanka made sure that was never an option",
        "entities": [
            [
                72,
                78,
                "PERSON"
            ]
        ]
    },
    {
        "text": "good length on off from Theekshana. Punched off the back foot to long on",
        "entities": [
            [
                24,
                34,
                "PERSON"
            ]
        ]
    },
    {
        "text": "good length ball just outside off. Rizwan hangs on the back foot and pokes at the ball very late, getting a late dab past short third for a boundary!",
        "entities": [
            [
                35,
                41,
                "PERSON"
            ]
        ]
    },
    {
        "text": "appeal for lbw off this googly. Full ball outside off and turning in with the batter looking to defend off the front foot. Hits the front leg and the ball rolls away to short third. Shanaka reviews this not-out decision. Prima facie looks like impact is probably outside off stump. But first, UltraEdge since the ball is close to the bat's inside edge. UltraEdge taking time to load....giving Rizwan enough time to take a breather. He's been scurrying between the wickets all innings, and Dubai is warm. Been over two minutes, still waiting for the UltraEdge. And Ultra_edge says the ball hit the bat! We won't need to ball-tracking at all. Sri Lanka lose a review.",
        "entities": [
            [
                393,
                399,
                "PERSON"
            ]
        ]
    },
    {
        "text": "back of a length just outside off. Doesn't bounce as much as Rizwan expected it. Jabbed down to deep third",
        "entities": [
            [
                61,
                67,
                "PERSON"
            ]
        ]
    },
    {
        "text": "out of syllabus! Iftikhar seemed to be the accumulator for so long, but he he has now taken on Sri Lanka's trump card. Full outside off, and the googly ends up coming in his arc. Swings across the line and the slog sweep is deposited at deep midwicket",
        "entities": [
            [
                17,
                25,
                "PERSON"
            ]
        ]
    },
    {
        "text": "one-bounce four! Full on off. Iftikhar clears the front leg and hits an inside-out lofted shot over Hasaranga's head. Long off running to his right to cut it off, but alas for Sri Lanka, he can't get there!",
        "entities": [
            [
                30,
                38,
                "PERSON"
            ]
        ]
    },
    {
        "text": "short and wide. Tries to cut but misses. Keeper fluffs it too, but doesn't seem to be any edge, or was there? We'll never quite find out. A tidy over from Theekshana.",
        "entities": [
            [
                155,
                165,
                "PERSON"
            ]
        ]
    },
    {
        "text": "mowed into the night sky! However, it doesn't have the legs for six. A 127kph delivery, full on off. Iftikhar clears the front leg and tries to hammer it for half a dozen, but he's sliced the shot. Fielder at deep backward square leg got under it, then waited nervously for the ball to come down, and then took a catch before taking a tumble onto the ground. Third scalp for Pramod Madushan Liyanagamage",
        "entities": [
            [
                375,
                403,
                "PERSON"
            ],
            [
                101,
                109,
                "PERSON"
            ]
        ]
    },
    {
        "text": "hat-trick of dots! Full on leg. Nawaz clears the front leg to slog into the leg side. Misses, past his edge, past leg stump too!",
        "entities": [
            [
                32,
                37,
                "PERSON"
            ]
        ]
    },
    {
        "text": "fourth dot in a row, and very nearly a wicket too! Slower through the air. Length ball on off, and gets a bit late to Nawaz as he tries to punch off the back foot. Hits the top-half of the bat, and the ball pops back for DDS to perhaps take a catch, but the ball falls just in front! #Tantalising",
        "entities": [
            [
                118,
                123,
                "PERSON"
            ]
        ]
    },
    {
        "text": "short ball, on leg stump. Nawaz tries to pull but the ball gets somewhat big on him. Nonetheless, he's got some connection, but clearly not good enough! Gobbled up by deep backward square well inside the boundary line.",
        "entities": [
            [
                26,
                31,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Rizzy unshackled? Just what Pakistan needed, and Rizwan gets to fifty too in style. Full ball, bit wide outside off. Steps onto the off side and slog sweeps into the stands behind cow corner",
        "entities": [
            [
                49,
                55,
                "PERSON"
            ]
        ]
    },
    {
        "text": "slower ball again, just outside off. Rizwan comes down the ground to create some momentum but ends up toe-ending his attempted drive to square leg",
        "entities": [
            [
                37,
                43,
                "PERSON"
            ]
        ]
    },
    {
        "text": "key player gets key player! Rizwan had no choice at this point except to go for a big shot when he could've. Hasaranga tossed this up outside off and Rizwan attempted the slog sweep, but he couldn't hit it well enough to clear the fielder at deep midwicket.",
        "entities": [
            [
                28,
                34,
                "PERSON"
            ]
        ]
    },
    {
        "text": "one slip for Shadab. Full on off. Googly pushed to wide long on",
        "entities": [
            [
                13,
                19,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Hasaranga has the midas touch! Full ball on middle stump. Googly going away from Khushdil and he tries to slog against the spin. Sliced high up, short third man gets under it, and that's a third scalp in the over for #WOWindu",
        "entities": [
            [
                81,
                89,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full ball on middle. Down on one knee and swiped to deep backward square leg. Could've been run out at the non-striker's, but the bowler Theekshana cannot collect the ball cleanly. Otherwise, Rauf was gone. Nonetheless, the umpires are going upstairs to see what happened. Yes, confirmed, Rauf survives because of the bowler's error.",
        "entities": [
            [
                137,
                147,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Theekshana finishes his spell with a wicket and this is Shadab. Full and wide, Shadab tries to club a six over extra cover but he's sliced it. Gunathilaka runs in, grabs the catch, and slides to reduce his momentum",
        "entities": [
            [
                0,
                10,
                "PERSON"
            ],
            [
                56,
                62,
                "PERSON"
            ]
        ]
    },
    {
        "text": "what an absolute belter of a delivery that is. My goodness, that is filthy. Tailing in at 142 kph, seaming in, clips the pads and uproots off stump. Enthralling start from Pakistan, and Mendis is gone for a golden duck",
        "entities": [
            [
                186,
                192,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball, nipping away at 142 kph, Nissanka defends",
        "entities": [
            [
                38,
                46,
                "PERSON"
            ]
        ]
    },
    {
        "text": "and Naseem lands it on the length Hasnain did the previous over, and Nissanka shows he's just as prolific at putting those kinds of balls away through cover",
        "entities": [
            [
                69,
                77,
                "PERSON"
            ]
        ]
    },
    {
        "text": "but as soon as we say that, Haris Rauf knocks back middle and off stump to send Gunathilaka packing. 151 kph, that ball, and Haris reels away in celebration. Pakistan have struck another vital blow to Sri Lanka within the Powerplay",
        "entities": [
            [
                28,
                38,
                "PERSON"
            ],
            [
                80,
                91,
                "PERSON"
            ]
        ]
    },
    {
        "text": "It's hit him on the toes. Might have struck him outside leg stump, and Pakistan review. Wow, that is the closest not-out I've seen in ages. It pitched in line, hit him in line, but was deemed to be swinging away and it's umpire's call on impact. Rajapaksa survives by the skin of his teeth",
        "entities": [
            [
                246,
                255,
                "PERSON"
            ]
        ]
    },
    {
        "text": "another wicket! This was a rare ugly shot from de Silva, who opened up his body and tried to slap it over the bowler's head. But he never found the elevation, and Iftikhar takes a splendid reflex catch to send de Silva packing",
        "entities": [
            [
                163,
                171,
                "PERSON"
            ]
        ]
    },
    {
        "text": "another little drop and run, and Iftikhar's bowled an extremely valuable over for his captain here",
        "entities": [
            [
                33,
                41,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full ball on middle. Googly turns across the bat as Rajapaksa steps forward to fend. Whizzes past the outside edge.",
        "entities": [
            [
                52,
                61,
                "PERSON"
            ]
        ]
    },
    {
        "text": "this guy will never stop attacking! Moves a bit to the leg side as soon as Shadab delivers this full ball on middle. Drives with the turn, hitting the googly over extra cover",
        "entities": [
            [
                75,
                81,
                "PERSON"
            ]
        ]
    },
    {
        "text": "fullish on off. Googly is punched past the non-striker. Shadab runs to his right to try and stop it",
        "entities": [
            [
                56,
                62,
                "PERSON"
            ]
        ]
    },
    {
        "text": "around the stumps again, and Rajapaksa sticks his bat out to this length ball outside off to successfully hit a late cut past short third man for another four!",
        "entities": [
            [
                29,
                38,
                "PERSON"
            ]
        ]
    },
    {
        "text": "up and over! Tosses it up on leg. Rajapaksa comes down the track and hammers it back over Shadab's grasp. #StraightAsAnArrow",
        "entities": [
            [
                90,
                96,
                "PERSON"
            ],
            [
                34,
                43,
                "PERSON"
            ]
        ]
    },
    {
        "text": "length ball on leg. The googly is turning towards off. Rajapaksa nurdles it behind square on the off side and off they go for a single. Hasaranga dives at the batter's end trying to complete the run, and is safe despite a good throw at the top of the stumps",
        "entities": [
            [
                55,
                64,
                "PERSON"
            ]
        ]
    },
    {
        "text": "Shadab finishes with 1 for 28 and Hasaranga will keep strike. Quicker ball on leg and the googly takes it further down leg. But he essentially ends up following Wanindu, who had moved to the leg side to make some room. Hits him on the pad and the ball rolls away to short cover",
        "entities": [
            [
                0,
                6,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full on off. Presses forward and fends it back to Nawaz",
        "entities": [
            [
                50,
                55,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full ball on off stump. Push-and-run to cover's right. Just three off Nawaz's first",
        "entities": [
            [
                70,
                75,
                "PERSON"
            ]
        ]
    },
    {
        "text": "full outside leg. Rajapaksa makes room offering all three stumps to the batter before driving to deep extra cover",
        "entities": [
            [
                18,
                27,
                "PERSON"
            ]
        ]
    },
    {
        "text": "around the stumps. Full, slow ball on off. Rajapaksa goes for a big shot, but ends up skying the shot high up. Massive air time since the ball has gone high into the night sky, and Shadab settles under it at long off. Tries to take a reverse cup catch, but the ball hits his finger and goes behind him thereafter. Lucky him that doesn't go for four, however it will go down as a dropped catch",
        "entities": [
            [
                43,
                52,
                "PERSON"
            ]
        ]
    },
    {
        "text": "swing and miss. Back of a length ball on leg. Rajapaksa gets in position to swipe this short ball across the line, but the ball goes over the blade, and through to Rizwan.",
        "entities": [
            [
                46,
                55,
                "PERSON"
            ]
        ]
    },
    {
        "text": "top over so far from Hasnain as the keeps varying his pace. Only 132kph, this length ball on leg. Rajapaksa moved to the off side to play a cute paddle, but was deceived by the lack of pace",
        "entities": [
            [
                98,
                107,
                "PERSON"
            ]
        ]
    },
    {
        "text": "two fielders collide, and even better for Sri Lanka, this has gone over the ropes! Shadab is lying down on the floor, Asif Ali the other man. Good length on middle stump. Rajapaksa swiped this across the line. Shadab at deep midwicket runs to his right. Asif at long on runs to his left. Both get under it. Shadab's head crashes into Asif's elbow, ball hits Asif's palm, and the momentum makes the ball pop out of his hands. Over the ropes.",
        "entities": [
            [
                171,
                180,
                "PERSON"
            ]
        ]
    },
    {
        "text": "short ball, slower ball on middle. Rajapaksa waits for it to get to him to try and ramp it over Rizwan, but misses",
        "entities": [
            [
                35,
                44,
                "PERSON"
            ]
        ]
    },
    {
        "text": "cute shot! Full on middle and leg. Rajapaksa moves to the off side, gets low, and plays a paddle behind the keeper for four! Lands an inch or two inside the boundary line.",
        "entities": [
            [
                35,
                44,
                "PERSON"
            ]
        ]
    }
]